{
  "university_name": "University of Birmingham",
  "university_website": [
    "http://www.birmingham.ac.uk/International/study-abroad/study-abroad-incoming/index.aspx",
    "https://www.birmingham.ac.uk/undergraduate/courses/termdates.aspx",
    "https://program-and-modules-handbook.bham.ac.uk/webhandbooks/WebHandbooks-control-servlet?Action=getSchoolList",
    "http://www.birmingham.ac.uk/International/study-abroad/study-abroad-incoming/applying.aspx",
    "http://www.birmingham.ac.uk/International/study-abroad/study-abroad-incoming/accommodation.aspx",
    "https://www.gov.uk/government/organisations/uk-visas-and-immigration",
    "https://www.birmingham.ac.uk/International/study-abroad/study-abroad-incoming/preparing/visa.aspx",
    "http://www.birmingham.ac.uk/International/study-abroad/study-abroad-incoming/guidance.aspx",
    "https://intranet.birmingham.ac.uk/student/coronavirus/coronavirus-faqs-for-students.aspx#Questionsforstudentsonastudyabroadorexchangeprogramme"
  ],
  "university_country": "United Kingdom",
  "sem1_months": ["Late September", "October", "November", "December", "Late January"],
  "sem2_months": ["Early-February", "March", "April", "May", "Mid-June"],
  "faculties_accepted": [
    "College of Arts and Law (excluding Music subject areas)",
    "College of Engineering and Physical Sciences",
    "College of Social Sciences (excluding Birmingham Business School)",
    "College of Life & Environmental Sciences",
    "Birmingham’s Liberal Arts and Natural Science (only for USP students)"
  ],
  "module_restrictions": "Modules from the Birmingham Business School, Law School, College of Medical and Dental Sciences are not open to NUS students. Third-year (Honours level) courses will usually only be available to you if you are majoring in the subject area and have at least two years background in the discipline.",
  "visa_info": {
    "consular/visa_regulation": "UK Visa and Immigration updates their immigration policy regularly. It is the student’s responsibility to check on the requirements via their website before they leave for the exchange. Standard Visitor Visa for Semester Exchange If you are a Singapore citizen or a citizen of another country on the UK non-visa nationals list, and if your course of studies is less than 6 months, you will request entry to the UK as a Standard Visitor when you arrive. Singapore citizens do not normally need to meet with a Border Force agent, and will be able to enter the UK through E-gates. Student Visa for Full-Year Exchange You need a Student Visa for a full-year exchange in Birmingham.",
    "health_insurance": "Students who are on exchange in UK for less than six months are not entitled to subsidised NHS treatment. Therefore, semester-based exchange students are encouraged to purchase additional insurance to cover medical costs, hospitalisation expenses and emergency evacuation costs which might be incurred while they are on exchange."
  },
  "accommodations_info": {
    "university_accommodation": "Birmingham guarantees accommodation for international exchange students. Students who need university accommodation should apply before the deadline. Accommodation is allocated on a first-come-first-served basis.",
    "private_accommodation": "Alternatively, students may decide to rent private accommodation. Housing Services at Birmingham offers a list of approved landlords for students who wish to rent privately. They also run a House Hunting Event at the start of each year."
  },
  "cost_of_living": "Details can be found at http://www.birmingham.ac.uk/International/study-abroad/study-abroad-incoming/preparing/finance.aspx",
  "university_description": null,
  "university_address": null,
  "location_cost_of_living": null,
  "location_weather": null,
  "location_description": null,
  "location_crime": null,
  "location_transportation": null,
  "location_halal": null,
  "location_vegetarian": null
}
