{
"university_name": "The University of Hong Kong",
"university_website": ["https://www.hku.hk/","https://intlaffairs.hku.hk/avail_program.php?pid=5&type=incoming","https://www.cedars.hku.hk/index.php?route=accommodation/accommodation","https://www.studentvisa.hku.hk/","http://www.nus.edu.sg/uhc/general-health/billing-insurance/insurance-matters","https://myportal.nus.edu.sg/studentportal/student-insurance/all/"],
"university_country": "Hong Kong, China SAR",
"sem1_months": ["September", "October", "November", "December"],
"sem2_months": ["January","February","March","April","May"],
"faculties_accepted": ["Business","Finance","Chinese","English","History","Philosophy","Japanese Studies","Geography","Politics and Public Administration","Psychology","Social Work and Social Administration","Sociology","Media Studies Centre","Civil Engineering","Electrical and Electronic Engineering","Industrial and Manufacturing Systems Engineering","Mechanical Engineering","Biomedical Engineering","Law","Chemistry","Earth Science","Mathematics","Physics","Statistics & Actuarial Science","Biological Sciences","Computer Science"],
"module_restrictions": ["Faculty of Dentistry courses","Li Ka Shing Faculty of Medicine courses","BSc (Exercise and Health) Programme courses","Final year project courses provided by all faculties","Some courses in Faculty of Business and Economics"],
"visa_info": "All non-local students are required to obtain a student visa to study in HKSAR. Students must complete online visa application by the visa application deadline and send hard copies of application documents to designated visa office after receiving instructions. It will take at least 10 weeks to process student’s visa application and the visa application fee is non-refundable.",
"accommodations_info": "On-campus accommodation for exchange students is on first-come-first-served basis and NOT guaranteed. Most of the rooms are double room. Only St. John’s College, Ricci Hall and HKU Residential Colleges provide very limited single rooms. Some halls have compulsory meal plans, others do not. Students may apply for accommodation before receiving the Notice of Admission.",
"cost_of_living": {"accommodation": ["HK$2,450 - HK$7,500"],
"food": ["HK$5,000"],
"transport": ["HK$300"],
"others": ["HK$1,000 - HK$2,000"],
"monthly_estimate": ["HK$8,750 - HK$14,800"]},
"university_description": "The University of Hong Kong (HKU), founded in 1911, is the oldest tertiary institution in Hong Kong and one of the best comprehensive universities in Asia. The campus is situated on the north-western slopes of Hong Kong Island between 50 to 150 metres above sea level and overlooks the wide sweep of Victoria Harbour. Since its establishment in 1911, it has undertaken the mission of providing a holistic education, developing the intellectual and personal strengths of its students.",
"university_address": "",
"location_cost_of_living": "",
"location_weather": "",
"location_description": "Hong Kong is a special administrative region on the eastern side of the Pearl River estuary in southern China. With a population of over seven million of people and a total land area of 1,106 km², Hong Kong is one of the most densely populated regions in the world. Hong Kong is known for its impressive skyline and deep natural harbor. The city has lots of architectural style influenced by the many different cultures that have come through its doors.",
"location_crime": "",
"location_transportation": "",
"location_halal": "",
"location_vegetarian": ""
}
