{
"university_name": "University of Victoria",
"university_website": ["https://www.uvic.ca/"],
"university_country": "Canada",
"sem1_months": ["September", "October", "November", "December"],
"sem2_months": ["January", "February", "March", "April"],
"faculties_accepted": [],
"module_restrictions": null,
"visa_info": "Exchange students who study for one semester only (less than 6 months) are not required to apply for a study permit. However, depending on your country of citizenship, you may have to apply for an eTA OR a visitor visa.",
"accommodations_info": "All incoming exchange students are automatically enrolled in the guard.me@UVic plan upon course registration at UVic. It is recommended that you purchase a comprehensive travel insurance for the full duration of your stay abroad. Students can purchase additional health and/or travel insurance from their preferred agent.",
"cost_of_living": null,
"university_description": "The University of Victoria is a large public research university located in the city of Victoria, British Columbia, Canada. The university offers a wide range of programs and degrees across its ten faculties, including the Faculty of Arts and Science, the Gustavson School of Business, and the Faculty of Law.",
"university_address": null,
"location_cost_of_living": "Victoria is known for being relatively expensive, with high costs of rent, food, and transportation.",
"location_weather": "Victoria has a mild, rainy climate typical of the Pacific Northwest. Winters are rainy and mild, while summers are drier and warmer.",
"location_description": "Victoria is the capital city of British Columbia, and is known for its beautiful waterfront, rich history, and vibrant arts and cultural scene. The city is located on the southern tip of Vancouver Island, and is home to a diverse population of approximately 85,000 residents.",
"location_crime": "Victoria has a relatively low crime rate compared to other Canadian cities of its size, and is generally considered a safe place to live and study.",
"location_transportation": "Victoria has an extensive public transportation system, including buses, ferries, and bike lanes. Students can purchase discounted transit passes through the university.",
"location_halal": "Halal food options are available in Victoria, although they may be limited. Students can find halal restaurants and grocery stores in the city.",
"location_vegetarian": "Vegetarian food options are widely available in Victoria, with many restaurants and cafes offering vegetarian and vegan menu items."
}