{
  "university_name": "Shanghai Jiao Tong University",
  "university_website": [
    "http://www.jwc.sjtu.edu.cn/jxxl/bnxlst.htm",
    "https://isc.sjtu.edu.cn/EN/content.aspx?info_lb=20&flag=3",
    "https://isc.sjtu.edu.cn/kindeditor/Upload/file/20211208/20211208172527_3429.pdf",
    "https://isc.sjtu.edu.cn/ueditor/net/upload/2020-11-23/1295a317-784a-4fd6-b1e2-d274d7c0168b.zip",
    "https://i.sjtu.edu.cn/jxzxjhgl/pyjhxxcx_cxPyjhxxIndex.html#",
    "http://isc.sjtu.edu.cn/EN/content.aspx?info_lb=260&flag=3",
    "http://isc.sjtu.edu.cn/EN/content.aspx?info_lb=293&flag=3",
    "http://isc.sjtu.edu.cn/EN/content.aspx?info_lb=163&flag=3",
    "https://www.visaforchina.cn/SGP2_EN/index.shtml",
    "https://www.visaforchina.cn/#/guideNav/Guidance?visacenterCode=SGP2&request_locale=en_US&site_alias=SGP2_EN",
    "https://isc.sjtu.edu.cn/EN/content.aspx?info_lb=314&flag=3",
    "https://isc.sjtu.edu.cn/EN/Default.aspx",
    "https://isc.sjtu.edu.cn/EN/content.aspx?info_lb=50&flag=3"
  ],
  "university_country": "China",
  "sem1_months": [
    "September",
    "October",
    "November",
    "December",
    "January"
  ],
  "sem2_months": [
    "February",
    "March",
    "April",
    "May",
    "June"
  ],
  "faculties_accepted": [],
  "module_restrictions": "Students can only choose the courses from the school that he/she enrolled in; both undergraduate and graduate courses. School of Medicine, Shanghai Advanced Institute of Finance and MBA/EMBA/MIB programmes of Antai College are not open to exchange students.",
  "visa_info": "Exchange students in China are required to apply for student visa (X2 visa for those intending to study in China for a period of no more than 180 days and X1 visa for those intending to study in China for a period of more than 180 days). You will receive the admission letter and visa application form (JW202) once you are accepted by the host university for the student exchange programme. Exchange students are required to apply for the student visa in person at the China Visa Application Service Centre in Singapore with the relevant documents before the start of the academic semester.",
  "accommodations_info": "Both Xuhui campus and Minhang campus provide on-campus dormitories. Students are required to submit reservation through online system. Due to the limited number of dormitories, on-campus accommodation is not guaranteed. Exchange students will need to arrange for off-campus accommodation if application for on-campus accommodation is unsuccessful. Students without a successful online reservation for on-campus accommodation is required to arrange for off-campus accommodation before arrival. Students may refer to the Information on the Off-Campus Accommodation.",
  "cost_of_living": "The necessary expenses for the duration of the SEP range from S$5,000 to S$15,000 per semester, subject to the country and local conditions at the overseas Partner University during the period of exchange. In the neighborhood of Xuhui campus, the average rent for one-room lodging is 3,000 yuan per month. While around Minhang campus, the average rent will be around 2,000 yuan per month.",
  "university_description": "Shanghai Jiao Tong University is a top research university located in Shanghai, China. It is known for its research in engineering, technology, medicine, and business. It has an international student body and a collaborative environment that fosters creativity and innovation.",
  "university_address": "",
  "location_cost_of_living": "",
  "location_weather": "",
  "location_description": "Shanghai is a bustling metropolis located on the eastern coast of China. It is known for its futuristic skyline, historical landmarks, and vibrant culture. It is a global hub for business, finance, and technology, and is an exciting place to live and work.",
  "location_crime": "",
  "location_transportation": "Shanghai has a well-developed transportation system that includes an extensive subway network, buses, and taxis. It is also a bike-friendly city, with many dedicated bike lanes.",
  "location_halal": "",
  "location_vegetarian": ""
}
