{
  "university_name": "The University of Liverpool",
  "university_website": ["https://www.liverpool.ac.uk/study-abroad/inbound/",
                          "https://www.liverpool.ac.uk/term-dates/",
                          "https://www.liverpool.ac.uk/study-international/apply/english-language/undergraduate-entry/",
                          "https://www.liverpool.ac.uk/study-abroad/inbound/study-in-liverpool/academic/",
                          "https://www.liverpool.ac.uk/study-abroad/inbound/study-in-liverpool/accommodation/",
                          "https://www.liverpool.ac.uk/studentsupport/international/visas/",
                          "https://myportal.nus.edu.sg/studentportal/student-insurance/all/",
                          "https://www.liverpool.ac.uk/study/international/tuition-fees-and-scholarships/living-costs/",
                          "https://www.liverpool.ac.uk/coronavirus-safety/"],
  "university_country": "United Kingdom",
  "sem1_months": ["Late September", "October", "November", "December", "January"],
  "sem2_months": ["Early February", "March", "April", "May", "Early June"],
  "faculties_accepted": [
    "Faculty of Humanities and Social Sciences (excluding modules offered by the Department of Architecture, Department of Law and the University of Liverpool Management School)",
    "Faculty of Science and Engineering",
    "Faculty of Health and Life Sciences (excluding modules offered by the School of Dentistry, School of Medicine, School of Veterinary Science and School of Health Sciences)"
  ],
  "module_restrictions": "Postgraduate modules are not open to undergraduate exchange students.",
  "visa_info": ["https://www.gov.uk/government/organisations/uk-visas-and-immigration",
                "https://www.liverpool.ac.uk/studentsupport/international/visas/"],
  "accommodations_info": "Exchange students for a semester is able to apply for a room in the Study Abroad Village, which is located in Tudor Close and Melville Grove Halls of Residence.",
  "cost_of_living": "Information on cost of living can be found at https://www.liverpool.ac.uk/study/international/tuition-fees-and-scholarships/living-costs/",
  "university_description": "The University of Liverpool is a public research university in Liverpool, England. It was founded as a college in 1881 and gained its royal charter in 1903 with the ability to award degrees.",
  "university_address": "The University of Liverpool, University Square, Brownlow Hill, Liverpool L69 3BX, United Kingdom",
  "location_cost_of_living": "Liverpool is considered to have a relatively low cost of living compared to other major UK cities. Housing costs are also relatively affordable in Liverpool compared to the rest of the UK.",
  "location_weather": "Liverpool features a temperate maritime climate which is generally mild with cool summers and mild winters.",
  "location_description": "Liverpool is a city and metropolitan borough in Merseyside, England, with a population of over 500,000. It is known for its rich history and culture, and is home to many museums, galleries, and landmarks.",
  "location_crime": "Liverpool has an average crime rate compared to other cities in the UK. However, as with any city, it is important to stay aware of your surroundings and take necessary precautions.",
  "location_transportation": "Liverpool has a comprehensive public transportation system, including buses, trains, and a metro system. The city is also relatively compact and walkable, with many attractions located close together.",
  "location_halal": "Liverpool has many halal food options available throughout the city, including many restaurants and cafes.",
  "location_vegetarian": "Liverpool has many vegetarian food options available throughout the city, including many restaurants and cafes."
}
