{
   "university_name": "University of British Colombia",
   "university_website": [
      "https://global.ubc.ca/go-global/coming-ubc-study-abroad/coming-ubc-exchange/key-dates-applying-ubc-exchange",
      "https://global.ubc.ca/go-global/coming-ubc-study-abroad/coming-ubc-exchange/budgeting-exchange",
      "https://global.ubc.ca/go-global/coming-ubc-study-abroad/coming-ubc-exchange/"
   ],
   "university_country": "Canada",
   "sem1_months": [
      "September",
      "October",
      "November",
      "December"
   ],
   "sem2_months": [
      "January",
      "February",
      "March",
      "April"
   ],
   "faculties_accepted": "N/A",
   "module_restrictions": "N/A",
   "visa_info": "Exchange students who study for one semester only (less than 6 months) are not required to apply for a study permit. However, depending on your country of citizenship, you may have to apply for an eTA OR a visitor visa. For more information on visa applications, please refer to https://www.cic.gc.ca/english/visit/visas.asp.",
   "accommodations_info": "N/A",
   "cost_of_living": "N/A",
   "university_description": "The University of British Columbia (UBC) is a public research university with campuses in Vancouver and Kelowna, British Columbia. It offers undergraduate programs, graduate and postgraduate programs, and cultural, professional, and educational programs.",
   "university_address": "2329 West Mall, Vancouver, BC V6T 1Z4, Canada",
   "location_cost_of_living": "The cost of living in Vancouver is moderately high. According to Numbeo, Vancouver ranks 76th out of 444 cities in the world.",
   "location_weather": "The weather in Vancouver is generally mild and rainy, with high temperatures ranging from 21–25°C (70–77°F) in summer and low temperatures ranging from −2–7°C (28–45°F) in winter.",
   "location_description": "Vancouver is a coastal seaport city in western Canada, located in the Lower Mainland region of British Columbia. It is the largest city in British Columbia and the third-largest metropolitan area in Canada.",
   "location_crime": "According to the Numbeo Crime Index, Vancouver has a moderate crime rate compared to other Canadian cities.",
   "location_transportation": "Vancouver has excellent public transportation, including trains, buses, and ferries. The city is also bike-friendly, and many residents choose to bike or walk to work and other destinations.",
   "location_halal": "There are many halal food options available in Vancouver, especially in neighborhoods with large Muslim populations.",
   "location_vegetarian": "There are many vegetarian food options available throughout Vancouver, including vegetarian and vegan restaurants."
}
