{
  "university_name": "École Nationale Supérieure des Mines de Paris (MINES ParisTech)",
  "university_website": ["http://www.mines-paristech.fr/"],
  "university_country": "France",
  "sem1_months": ["September", "October", "November", "December", "January"],
  "sem2_months": ["February", "March", "April", "May", "June"],
  "faculties_accepted": ["Mathematics and systems", "Energy and process engineering", "Mechanical engineering and materials", "Earth sciences and environment", "Economics, management and society"],
  "module_restrictions": ["Students must have completed at least 5 semesters of undergraduate studies before participating in exchange programme at MINES ParisTech.", "Not all the courses are open to visiting students due to limited number of places."],
  "visa_info": ["Long-Stay visas are necessary for stays exceeding 3 months.", "Upon arrival in France, students are required to register with the French Immigration and Integration Office (OFII) for a residence permit. Students must follow the Campus France procedure on Etudes en France online platform before applying for a visa."],
  "accommodations_info": ["Accommodation offered to visiting students, if available, will be at either MINES ParisTech residences - Maison des Mines or Cité Internationale Universitaire de Paris (CIUP)."],
  "cost_of_living": {
    "Monthly Estimate": "€640 - €1,040",
    "Breakdown of Costs": {
      "Accommodation": "€200 - €600",
      "Food": "€200",
      "Transport": "€50",
      "Insurance": "€40",
      "Others (Entertainment, clothes)": "€150"
    }
  },
  "university_description": "École Nationale Supérieure des Mines de Paris (MINES ParisTech) is a graduate school in the French higher education institution structure.",
  "university_address": "60 Boulevard Saint-Michel, 75272 Paris Cedex 06, France",
  "location_cost_of_living": "Paris is known to be expensive, with high costs for accommodation, food, and entertainment.",
  "location_weather": "Paris has a temperate oceanic climate, with mild winters and warm summers.",
  "location_description": "Paris is the capital city of France, known for its art, architecture, cuisine, and museums. It is a major center for business, fashion, and culture.",
  "location_crime": "Paris has a moderate crime rate, with pickpocketing being a common occurrence. However, violent crime is rare.",
  "location_transportation": "Paris has an extensive public transportation system, including an extensive metro and bus network.",
  "location_halal": "Paris has a wide selection of halal food options, with many restaurants and markets catering to Muslim dietary restrictions.",
  "location_vegetarian": "Paris has many vegetarian and vegan restaurants, as well as supermarkets and markets offering vegetarian options."
}
