{
  "university_name": "Kyoto University",
  "university_website": ["http://www.kyoto-u.ac.jp/en"],
  "university_country": "Japan",
  "sem1_months": ["APR", "MAY", "JUN", "JUL", "AUG", "SEP"],
  "sem2_months": ["OCT", "NOV", "DEC", "JAN", "FEB", "MAR"],
  "faculties_accepted": ["Institute for Liberal Arts and Sciences", "Faculty of Economics", "Faculty of Education", "Faculty of Engineering", "Faculty of Integrated Human Studies", "Faculty of Law", "Faculty of Letters", "Faculty of Pharmaceutical Science", "Faculty of Science"],
  "module_restrictions": "Graduate level courses are not available to undergraduate students. Exchange students can take courses which start and end within the period of their exchange at Kyoto U. Courses of Faculty of Medicine are not open to exchange students. Please note that some courses offered by the Faculties, including almost all courses offered by Faculty of Letters start in April and end in March. Such courses can be taken only by students who stay at Kyoto U for one full year exchange.",
  "visa_info": "Upon acceptance, Kyoto U will apply for a Certificate of Eligibility on your behalf with the Japanese Ministry of Justice, and send it to you when issued. The certificate is required for you to apply for a study visa. Exchange students must obtain a “College Student” visa for the duration of their study in Japan. Please visit the Japan Embassy website for the required supporting documents for your visa application. All students are advised to apply for the necessary visa immediately after they received the official offer letter/email from their host university. This is to ensure that you can obtain your visa in time before the start of your exchange term. Your exchange at the host university depends on the clearance by the immigration of the host country.",
  "accommodations_info": "Kyoto U has one on-campus and four off-campus International Houses, and other dormitories available to international students. Students do not have to apply for accommodation by themselves but will be required to send back the pre-registration form enclosed in the acceptance package. Students can choose to stay in one of the following accommodations - Yoshida International House (located on campus), Shugakuin International House and Misasagi International House. Other accommodation options include Mizuki-Dormitory, Satuski-Domitory and Dormitory Hyakumanben.",
  "cost_of_living": "The estimated monthly living expenses in Kyoto are as follows:\n\n- Accommodation: JP¥12,000 - JP¥50,000\n- Food: JP¥30,000 - JP¥60,000\n- Transport: JP¥8,000 - JP¥20,000\n- Insurance: JP¥2,000 - JP¥3,000\n- Others (Entertainment, clothes): JP¥25,000\n\nMonthly Estimate: JP¥77,000 - JP¥158,000"
}