{
  "university_name": "Carleton College",
  "university_website": [
    "http://www.carleton.edu/",
    "https://apps.carleton.edu/intl/"
  ],
  "university_country": "USA",
  "sem1_months": [
    "SEP",
    "OCT",
    "NOV"
  ],
  "sem2_months": [],
  "faculties_accepted": [
    "USP"
  ],
  "module_restrictions": "This exchange program is open only to students from the University Scholars Program. USP students from all Faculties will apply for exchange at Carleton through USP. Interviews will be conducted to select suitable students. Successful applicants will attend Carleton only in the fall term (NUS Sem 1).",
  "visa_info": "All students are advised to apply for the necessary visa immediately after they receive the official offer letter/email from their host university. Some visa application processes can take up to 2 months to process. Your exchange at the host university depends on the clearance by the immigration of the host country. It is necessary for international students and exchange visitors to make appointments with the U.S. embassy or consulate in their country in a timely fashion in order to receive a visa. Students are expected to obtain a J-1 Student Entry Visa. You must present the required documents to the consular section of the U.S. Embassy, as instructed by Carleton closer to the time of application. Please note that there will be a USD$180 SEVIS Fee (amount subject to rise) which must be paid before you go to the embassy for your visa interview.",
  "accommodations_info": "On campus housing: Most of Carleton's students—and all first-year students—live in one of the College's residence halls (dorms). Most floors have a diverse mix of men and women from all four classes, and RAs are there to coordinate floor and hall activities and other social and educational events. All residence halls have lounges, TVs and laundry facilities. All campus buildings are smoke-free and most halls have substance-free floors. International exchange students are required to live in one of the on-campus residential halls.",
  "cost_of_living": "The estimated monthly living expenses can be found at the following links: http://apps.carleton.edu/campus/sfs/costs/ and https://apps.carleton.edu/intl/practicalmatters/financial/"
}