[{
  "university_name": "Imperial College London",
  "university_website": ["http://www.imperial.ac.uk/placements/student-exchanges/information-for-student-exchange-partner-universities/"],
  "university_country": "United Kingdom",
  "sem1_months": ["SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR"],
  "faculties_accepted": ["Aeronautics Engineering", "Bioengineering Engineering", "Chemical Engineering", "Electrical and Electronic Engineering", "Mechanical Engineering"],
  "module_restrictions": "At Imperial, the timetables for classes are often not approved until September. Therefore, it is not possible to confirm any programme of study until you have arrived at the College. Students are encouraged to take courses offered by the same department at the same level to avoid potential clash of timetable. For example, it is recommended that you take all year 2 courses at Department of Electronic and Electrical Engineering. Imperial is also unable to offer study plans involving teaching from more than one department or from both the undergraduate curriculum (BEng/MEng/BSc/MSci) and postgraduate curriculum (MSc/MRes). Course Catalogues: The most recent and relevant syllabus information (electronic documents or departmental web links) continue to be available from the relevant departmental student exchange co-ordinator responsible for individual exchange links.",
  "visa_info": "UK Visa and Immigration updates their immigration policy regularly. It is the student’s responsibility to check on the requirements via their website before they leave for the exchange. https://www.gov.uk/government/organisations/uk-visas-and-immigration For latest information on border control please see: https://www.gov.uk/uk-border-control Students must obtain a Student Visa for a full year exchange in Imperial. To apply for Student Visa, please refer to “Guidance/Information Document for Nominated Exchange Students” for more information. Applicants should ensure that they are fully aware of what they will need to do in order to successfully apply for a Student Visa. The CAS statement will contain a number that allows student to apply for a Student Visa. The application for Student Visa can take up to three months and students are advised to apply for the visa in advance of their intended date of travel to the UK. Specific questions concerning visas can be addressed to the Imperial’s International Student Support Team: international@imperial.ac.uk. More information can be found at http://www.imperial.ac.uk/study/international-students/visas-and-immigration/applying-for-a-student-visa-overseas/ Your exchange at the host university depends on the clearance by the immigration of the host country.",
  "accommodations_info": "The “Guidance/Information Document for Nominated Exchange Students” also cover issues such as Accommodation and Orientation for when a student is successful with their application. Please note that the Imperial College London is normally only able to guarantee the offer of a room in a College hall of residence to undergraduate exchange students who accept admission for a full academic year and who have met any conditions of entry which may apply (see guidance for full details). Students can apply for Imperial’s accommodation once they receive the conditional offer from Imperial via Student e-Service. A student will be invited by email to apply for accommodation in a College hall of residence. The accommodation will be guaranteed for the full academic year if students submit the online accommodation application form by Imperial’s deadline and have met in full any conditions of entry (e.g. English language) and confirm their admission on Student e-Service by Imperials’ deadline. Please note that Imperial issue the Confirmation of Acceptance for Studies (CAS) – for inclusion in a visa application - when appropriate and this might be after 23 August. The issuing of the CAS does not influence the accommodation application routine.",
  "cost_of_living": "Students can find information and advice on living costs at managing your money (UG) and details can also be found at http://www.imperial.ac.uk/study/ug/fees-and-funding/managing-your-money/living-costs/"
}]
