{
  "university_name": "Korea University",
  "university_website": ["http://www.korea.edu/"],
  "university_country": "South Korea",
  "sem1_months": ["MAR", "APR", "MAY", "JUN"],
  "sem2_months": ["SEP", "OCT", "NOV", "DEC"],
  "faculties_accepted": ["Business", "Liberal Arts", "Life Sciences and Biotechnology", "Political Science and Economics", "Science", "Engineering", "Information and Communication", "Health Sciences", "Media and Communication", "Interdisciplinary Studies", "International Studies"],
  "module_restrictions": "Medicine, Nursing, Pharmacy, Law, Teacher Education, Information Security (Cyber Defense), Art & Design and all courses at Sejong Campus are not open to exchange students. Undergraduate students are not allowed to take postgraduate courses. KU is experiencing high demand for Business and Management courses. Therefore the chances of enrolling into these courses are very slim. NUS Business students should apply via the faculty-level SEP agreement in order to take Business courses at KU.",
  "visa_info": "Exchange students must apply for a D2 student visa before arrival in Korea. After you received the Certificate of Admission (CoA) and offer letter from your host university, you may proceed to the Korean Embassy to apply for the student visa, with the relevant supporting documents. All students are advised to apply for the necessary visa immediately after they received the official offer letter/email from their host university. This is to ensure that you can obtain your visa in time before the start of your exchange term. Your exchange at the host university depends on the clearance by the immigration of the host country.",
  "accommodations_info": "On-campus accommodation is available but limited. There are two types of on-campus halls of residence at KU – CJ International House (I-House) or Anam Hall 2. Most of the rooms are shared rooms. The on-campus accommodation is located within 20 minutes-walk to the main campus.\n\nExchange students are advised to apply as soon as possible as rooms are allocated to students on first-come-first-served basis. For more information about accommodation, please refer to https://gsc.korea.ac.kr/usr/service/accommodation.do\n\nThere is a wide range of off-campus housing available within close proximity to KU.",
  "cost_of_living": "The estimated monthly living expenses are as follows:\n\n- Accommodation: ₩300,000 - ₩500,000\n- Food: ₩400,000\n- Transport: ₩100,000\n- Academic Expenses: ₩50,000\n- Others (Entertainment, clothes): ₩250,000\n\nThe monthly estimate is ₩1,100,000 - ₩1,300,000."
}
