{
  "university_name": "The College of William and Mary",
  "university_website": [
    "http://www.wm.edu",
    "https://www.wm.edu/offices/registrar/calendarsandexams/ugcalendars/index.php",
    "http://catalog.wm.edu/index.php",
    "https://www.wm.edu/academics/undergraduateprograms/index.php",
    "http://www.wm.edu/offices/revescenter/issp/life/index.php",
    "https://myportal.nus.edu.sg/studentportal/student-insurance/all/",
    "http://www.wm.edu/offices/wellness/healthcenter/studentinsurance/plan/index.php",
    "https://www.wm.edu/offices/auxiliary/conferenceservices/plan/groupleaders/security/index.php"
  ],
  "university_country": "USA",
  "sem1_months": [
    "AUG",
    "SEP",
    "OCT",
    "NOV",
    "DEC"
  ],
  "sem2_months": [
    "JAN",
    "FEB",
    "MAR",
    "APR",
    "MAY"
  ],
  "faculties_accepted": [
    "FASS",
    "FoS",
    "SoC"
  ],
  "module_restrictions": "Exchange students are not allowed to take Law, Business Administration and Graduate-level courses.",
  "visa_info": "Exchange students will apply for a J-1 visa. In order to receive the necessary paperwork to apply for the J-1 visa, you will need to complete the iStart application. Accepted students will receive an email from iStart instructing you to complete the application. Immigration paperwork should be completed as soon as possible to avoid visa issuance delays. Please visit the W&M International Student & Scholar Programs' website to learn more about applying for a J-1 visa and the documents you will need to apply.",
  "accommodations_info": "On-campus Accommodation: William and Mary is mainly a residential campus with residence halls. Special housing options are also available, including fraternity/sorority housing, language houses, Reves Hall (for students interested in International Studies).\nComplete the online housing application as soon as possible. You will automatically be assigned on-campus housing typically in a shared room. Exchange students are required to live in on-campus housing. Each student must pay a refundable room damage deposit of USD $75; in addition, you are responsible for the cost of your own on-campus housing. On-campus housing costs are estimated at USD $2,400 to USD $3,200 per semester. Students must fill out a housing application online. There is no set deadline, applications are processed in the order received. More information can be found via: http://www.wm.edu/offices/revescenter/issp/life/index.php\nMeal Plan: William & Mary requires all students who live on campus-owned and managed properties to purchase a meal plan. Options vary depending on a student’s social class and living location. To learn more about the meal plans offered at William & Mary, visit the dining website. You must select a meal plan by the first day of classes or one will be automatically chosen for you.\nEarly arrivals: International on-campus students who arrive before the designated arrival dates are responsible for finding their own housing accommodations. Temporary on-campus housing is not available.",
  "cost_of_living": "Money Matters:\n- Tuition and Fees | As a visiting exchange student, you will not be billed for W&M’s standard tuition; rather, you will continue to pay your home university’s tuition. Please refer to your acceptance letter for a summary of other fees you may be responsible for during your semester(s) at William & Mary.\n- Student Accounts and Bills | Your orientation fee, health insurance, and housing and room deposit will appear on your student account. You can pay these either before you arrive or within the first week you are on campus. The meal plan will be charged once you have selected the option that best fits your needs. You must select a meal plan by the first day of classes or one will be automatically chosen for you.\n- Payment Options | There are several ways you can pay your fees, including W&M Flywire, which typically allows you to pay in your home currency. During Orientation, you will be given information about opening a bank account with a local bank. If you choose to do so, you will have checks to pay your student account bills and a debit card for other purchases.\n\nInformation correct as of July 2021. Please refer to the William & Mary links for the most up-to-date information."
}
