{
  "university_name": "The University of Liverpool (UoL)",
  "university_website": ["https://www.liverpool.ac.uk/study-abroad/inbound/"],
  "university_country": "United Kingdom",
  "sem1_months": ["SEP", "OCT", "NOV", "DEC", "JAN"],
  "sem2_months": ["FEB", "MAR", "APR", "MAY", "JUN"],
  "faculties_accepted": ["Faculty of Humanities and Social Sciences", "Faculty of Science and Engineering", "Faculty of Health and Life Sciences"],
  "module_restrictions": "Modules available to exchange students can be found in the guide provided.",
  "visa_info": "UK Visa and Immigration updates their immigration policy regularly. It is the student’s responsibility to check on the requirements via their website before they leave for the exchange. For latest information on border control please see: [https://www.gov.uk/uk-border-control](https://www.gov.uk/uk-border-control). Standard Visitor Visa for Semester Exchange: If you are a Singapore citizen or a citizen of another country on the UK non-visa nationals list, and if your course of studies is less than 6 months, you will request entry to the UK as a Standard Visitor when you arrive. Singapore citizens do not normally need to meet with a Border Force agent, and will be able to enter the UK through E-gates. The E-gates will automatically grant you permission to stay in the UK for up to 6 months. You will not receive a stamp on your passport thus it is important that you retain evidence of when you entered the UK. Hence, please keep your boarding pass or evidence of your flight itinerary. Please refer here for more details on the Standard Visitor Visa. Student Visa for Full-Year Exchange: You need a Student Visa for a full-year exchange in Liverpool. For more details on visa application, read the information available here.",
  "accommodations_info": "Exchange students for a semester are able to apply for a room in the Study Abroad Village, which is located in Tudor Close and Melville Grove Halls of Residence. These consist of self-catered, single study bedrooms with shared bathrooms and social spaces. All accommodation has access to a residential advisor, as well as student-led events and committees. All communal areas are cleaned every weekday. [https://www.liverpool.ac.uk/study-abroad/inbound/study-in-liverpool/accommodation/](https://www.liverpool.ac.uk/study-abroad/inbound/study-in-liverpool/accommodation/)",
  "cost_of_living": "The estimated living expenses per semester can be found at [https://www.liverpool.ac.uk/study/international/tuition-fees-and-scholarships/living-costs/](https://www.liverpool.ac.uk/study/international/tuition-fees-and-scholarships/living-costs/)"
}
