{"university_name": "Shanghai Jiao Tong University",
 "university_website": ["http://www.jwc.sjtu.edu.cn/jxxl/bnxlst.htm", "https://isc.sjtu.edu.cn/EN/content.aspx?info_lb=20&flag=3", "https://en.sjtu.edu.cn/schools", "https://isc.sjtu.edu.cn/kindeditor/Upload/file/20211208/20211208172527_3429.pdf", "https://isc.sjtu.edu.cn/ueditor/net/upload/2020-11-23/1295a317-784a-4fd6-b1e2-d274d7c0168b.zip", "https://i.sjtu.edu.cn/jxzxjhgl/pyjhxxcx_cxPyjhxxIndex.html#"],
 "university_country": "China",
 "sem1_months": ["SEP", "OCT", "NOV", "DEC", "JAN"],
 "sem2_months": ["FEB", "MAR", "APR", "MAY", "JUN"],
 "faculties_accepted": ["College of Humanities and Sciences (CHS)", "Faculty of Science (FoS)", "Faculty of Arts and Social Sciences (FASS)", "NUS Business School (BIZ)", "School of Computing (SoC)", "Faculty of Dentistry (DENT)", "College of Design and Engineering (CDE or FoE)", "Yong Loo Lin School of Medicine (YLLSOM)", "School of Law (LAW)", "School of Nursing", "Yong Siew Toh Conservatory of Music (YSTCM)"],
 "module_restrictions": "Students can only choose the courses from the school that he/she enrolled in; both undergraduate and graduate courses. School of Medicine, Shanghai Advanced Institute of Finance and MBA/EMBA/MIB programmes of Antai College are not open to exchange students.",
 "visa_info": "Exchange students in China are required to apply for student visa (X2 visa for those intending to study in China for a period of no more than 180 days and X1 visa for those intending to study in China for a period of more than 180 days). You will receive the admission letter and visa application form (JW202) once you are accepted by the host university for the student exchange programme. Exchange students are required to apply for the student visa in person at the China Visa Application Service Centre in Singapore with the relevant documents before the start of the academic semester.",
 "accommodations_info": "Both Xuhui campus and Minhang campus provide on-campus dormitories. Students are required to submit reservation through online system. Due to the limited number of dormitories, on-campus accommodation is not guaranteed. Exchange students will need to arrange for off-campus accommodation if application for on-campus accommodation is unsuccessful. For detailed information, please refer to http://isc.sjtu.edu.cn/EN/content.aspx?info_lb=260&flag=3. Students without a successful online reservation for on-campus accommodation is required to arrange for off-campus accommodation before arrival. Students may refer to the Information on the Off-Campus Accommodation at http://isc.sjtu.edu.cn/EN/content.aspx?info_lb=163&flag=3. In the neighborhood of Xuhui campus, the average rent for one-room lodging is 3,000 yuan per month. While around Minhang campus, the average rent will be around 2,000 yuan per month.",
 "cost_of_living": "There is no specific information provided in the PDF regarding the cost of living."}
