{
  "university_name": "Monash University",
  "university_website": [
    "https://www.monash.edu/students/dates/summary-dates",
    "https://www.monash.edu/study-abroad/inbound",
    "https://www.australia.gov.au/",
    "https://covid19.homeaffairs.gov.au/",
    "https://youtu.be/EVrAyCrir6E",
    "https://www.youtube.com/watch?v=969i7d4g_ZE"
  ],
  "university_country": "Australia",
  "sem1_months": [
    "FEB",
    "MAR",
    "APR",
    "MAY",
    "JUN"
  ],
  "sem2_months": [
    "JUL",
    "AUG",
    "SEP",
    "OCT",
    "NOV"
  ],
  "faculties_accepted": [
    "College of Humanities and Sciences (CHS)",
    "Faculty of Science (FoS)",
    "Faculty of Arts and Social Sciences (FASS)",
    "NUS Business School (BIZ)",
    "School of Computing (SoC)",
    "College of Design and Engineering (CDE or FoE)",
    "Yong Loo Lin School of Medicine (YLLSOM)",
    "School of Law (LAW)",
    "School of Nursing",
    "Yong Siew Toh Conservatory of Music (YSTCM)"
  ],
  "module_restrictions": null,
  "visa_info": "Once you have purchased the Overseas Student Health Cover (OSHC), your host university will issue an Electronic Confirmation of Enrolment (eCoE), which is required for your Australian Student Visa Application. All exchange students must obtain an Australian Non Award Student Visa (sub-class 500) before arriving in Australia. Students are advised to apply for the necessary visa immediately after they received the official offer letter/email from their host university. This is to ensure that you can obtain your visa in time before the start of your exchange term. Your exchange at the host university depends on the clearance by the immigration of the host country. For more information on visa applications, please refer to https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-500.",
  "accommodations_info": null,
  "cost_of_living": "The cost of living for exchange students at Monash University is approximately A$350 for 6 months. Students are required to purchase an approved Overseas Student Health Cover (OSHC) policy, which is a condition of the Overseas Student Visa issued by the Australian Immigration authorities. It is also recommended to purchase a comprehensive travel insurance for the full duration of the stay abroad, including personal travel within/outside Australia. Additional health and/or travel insurance can be purchased from the preferred agent."
}
