{
  "university_name": "University of Connecticut",
  "university_website": [
    "https://uconn.edu/",
    "https://abroad.uconn.edu/incoming/"
  ],
  "university_country": "USA",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["College of Humanities and Sciences (CHS)", "Faculty of Science (FoS)", "Faculty of Arts and Social Sciences (FASS)", "NUS Business School (BIZ)", "School of Computing (SoC)", "College of Design and Engineering (CDE or FoE)", "Yong Loo Lin School of Medicine (YLLSOM)", "School of Law (LAW)", "School of Nursing", "Yong Siew Toh Conservatory of Music (YSTCM)"],
  "module_restrictions": "Exchange students must take courses at the Storrs Campus and are not permitted to take courses at the Hartford, Waterbury, Stamford or Avery Point campuses. Exchange students are not allowed to take courses at Nursing, Pharmacy, Law, Social Work, Medicine and education. Students will not be able to take any more than 6 modules (18 credits) while on exchange at UConn.",
  "visa_info": "Once admitted to UConn, prospective international exchange students must request a Form DS-2019, which they will need to apply for a J-1 Exchange Visitor Visa and later on to enter and stay in the U.S. in legal J-1 status. Total visa costs, including a required SEVIS fee, can total a minimum of 340 USD. Citizens of some countries may be subject to extra visa reciprocity fees.\n\nAll exchange students must be able to demonstrate they are able to pay for all estimated expenses at UConn. Please make sure financial documents are translated into English to ensure fast processing.\n\nTo maintain your J-1 status, you must enroll in a full-time course load: 12 credits for undergraduate students, 9 credits for graduate students. Only classroom-based courses may count towards the minimum enrollment requirements for J-1 visa regulations. Distance learning, hybrid, and online courses cannot be used in calculating full-time status.",
  "accommodations_info": "We recommend that all exchange students live on campus in residence halls. On-campus living is an important part of American university life, and by living on campus, you become an active member of the UConn community and have access to all the social, recreational, and cultural events that take place. All dorm rooms are equipped with a bed, a mattress, a desk and chair, and a closet. In small units, doubles are 154 sq. ft. (11×14). Elsewhere, double rooms range in size up to 180 sq. ft. Most undergraduate dormitory rooms share bathroom facilities with other residents on the floor. Refrigerators, microwaves and televisions are not provided in dorm rooms.\n\n• Traditional Housing – Shared bedrooms with convenient access to dining halls and campus facilities. A campus meal plan is required.\n• Suites – Shared bedrooms, often with shared living spaces, with convenient access to dining halls and campus facilities. A campus meal plan is required.\n• Apartments – Independent-style housing that has shared bedrooms and living spaces (including full kitchens). You are NOT required to have a campus meal plan.\n\nPlease note that exchange students are not required to pay the Room Reservation Fee or the Acceptance Fee.",
  "cost_of_living": "The estimated monthly living expenses at UConn can be found at http://financialaid.uconn.edu/cost/"
}