{
  "university_name": "École Nationale Supérieure des Mines de Paris (MINES ParisTech)",
  "university_website": ["http://www.mines-paristech.fr/", "http://www.mines-paristech.eu/Prospective-student/Master-Degree/Master-Degree-in-Science-and-Executive-Engineering/Admission/Visiting-students/", "http://www.mines-paristech.eu/Prospective-student/Master-Degree/Master-Degree-in-Science-and-Executive-Engineering/Presentation/Courses-and-calendar/"],
  "university_country": "France",
  "sem1_months": ["SEP", "OCT", "NOV", "DEC", "JAN"],
  "sem2_months": ["FEB", "MAR", "APR", "MAY", "JUN"],
  "faculties_accepted": ["Mathematics and systems", "Energy and process engineering", "Mechanical engineering and materials", "Earth sciences and environment", "Economics, management and society"],
  "module_restrictions": "Students must have completed at least 5 semesters of undergraduate studies before participating in exchange programme at MINES ParisTech. Please note that not all the courses are open to visiting students due to limited number of places. These courses are: Ski Maths, Geology seminar, MIG, minor courses (cours d’option). Courses from 1st and 2nd Graduate years only are open to visiting students. Undergraduate year courses are not open to visiting students.",
  "visa_info": "Long-Stay visas are necessary for stays exceeding 3 months. Upon arrival in France, students are required to register with the French Immigration and Integration Office (OFII) for a residence permit. Please visit the websites of French embassies and consulates in your country. All students who wish to study in France must follow the Campus France procedure on Etudes en France online platform before applying for a visa. Please refer to http://www.singapour.campusfrance.org/page/student-visa-stays-france-more-90-days for details. Students can apply up to 3 months prior to the departure. During the peak period (from April to August), students are invited to apply as soon as they can, to avoid any delays, since it can take up to 2 weeks to get an appointment. All students are advised to apply for the necessary visa immediately after they received the official offer letter/email from their host university.",
  "accommodations_info": "Accommodation offered to visiting students, if available, will be at either MINES ParisTech residences - Maison des Mines or Cité Internationale Universitaire de Paris (CIUP). Accommodation arrangements are handled through the school. For more information, please refer to https://www.maisondesmines.com/mdm.php?page=gb_sommaire.",
  "cost_of_living": "The estimated monthly living expenses in France for visiting students at MINES ParisTech are as follows:\n\n- Accommodation: €200 - €600\n- Food: €200\n- Transport: €50\n- Insurance: €40\n- Others (Entertainment, clothes): €150\n\nMonthly Estimate: €640 - €1,040"
}
