{
  "university_name": "KTH Royal Institute of Technology",
  "university_website": ["http://www.kth.se", "https://www.kth.se/en/studies/exchange", "https://www.kth.se/en/student/schema/lasarsindelning", "https://www.kth.se/en/studies/exchange/courses", "https://www.kth.se/en/studies/exchange/why-kth/accommodation-1.529520", "https://www.kth.se/en/student/studentliv/new-in-sweden/residence-permit-for-studies-1.6909", "https://www.migrationsverket.se/English/Private-individuals.html", "https://myportal.nus.edu.sg/studentportal/student-insurance/all/"],
  "university_country": "Sweden",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY", "JUN"],
  "faculties_accepted": ["Architecture and the Built Environment (ABE)", "Engineering Sciences in Chemistry, Biotechnology and Health (CBH)", "Electrical Engineering and Computer Science (EECS)", "Industrial Engineering and Management (ITM)", "Engineering Science (SCI)"],
  "module_restrictions": "Exchange students should read a total of 30 ECs per semester and not more. Exchange students are nominated by their home university but the final decision of acceptance is made by KTH and is based on the individual assessment of each application. A minimum requirement is that exchange students applying to KTH have completed at least two years of the educational programme at their home university, with grades above average. Courses for exchange students should be approved by the home university in a Learning Agreement or Study plan. Some courses have prerequisites and may be limited in terms of availability.",
  "visa_info": "Students from non EU/EEA countries need to apply for a residence permit for studies before entering Sweden. They must have a valid passport, be admitted to full-time studies, be able to support themselves for the planned study period, have comprehensive health insurance, and have a Letter of Acceptance from KTH. The application process may take up to three months. It is advised to apply as soon as the Letter of Acceptance is received.",
  "accommodations_info": "KTH has an Accommodation Office that rents rooms for exchange students in student housing buildings and apartment houses. The location of the room will depend on availability. The housing contract always terminates on July 31. If a student does not want the assigned room, they must find another room themselves and cancel the booking with KTH Accommodation at least one month before the contract starts. More information on accommodation can be found at [https://www.kth.se/en/studies/exchange/why-kth/accommodation-1.529520](https://www.kth.se/en/studies/exchange/why-kth/accommodation-1.529520).",
  "cost_of_living": "The estimated monthly living expenses in Stockholm, Sweden are as follows: Accommodation - SEK3,000 to SEK6,200, Food - SEK2,000, Transport - SEK590, Telephone/Internet - SEK300, Others (Entertainment, clothes) - SEK2,250. The total monthly estimate ranges from SEK8,140 to SEK11,310."
}
