{
  "university_name": "Yonsei University",
  "university_website": [
    "http://www.yonsei.ac.kr",
    "https://oia.yonsei.ac.kr/intstd/exCalendar.asp",
    "http://oia.yonsei.ac.kr/intstd/exCourse.asp",
    "http://portal.yonsei.ac.kr/main/indexe.jsp",
    "http://ih.yonsei.ac.kr/"
  ],
  "university_country": "South Korea",
  "sem1_months": ["MAR", "APR", "MAY", "JUN"],
  "sem2_months": ["SEP", "OCT", "NOV", "DEC"],
  "faculties_accepted": [
    "Liberal Arts",
    "Commerce and Economics",
    "Business",
    "Science",
    "Engineering",
    "Life System",
    "Theology",
    "Social Science",
    "Human Ecology",
    "Sciences in Education",
    "Underwood International College",
    "Korean Language (KLI)"
  ],
  "module_restrictions": "Students are required to meet the pre-requisites for the courses that they applied. Students who plan to take courses taught in Korean are required to have KLAT Level 4, or an assessment report by a professor. Business courses are restricted to business majors only and students can take a maximum of four business courses under the School of Business and Office of International Affairs. Medicine, Dentistry, Nursing, Pharmacy, Music, MBA, Law, and courses offered in Songdo International Campus are not open to exchange students.",
  "visa_info": "Exchange students must apply for a D2 student visa before arrival in Korea. After you received the Certificate of Admission (CoA) and offer letter from your host university, you may proceed to the Korean Embassy to apply for the student visa, with the relevant supporting documents. All students are advised to apply for the necessary visa immediately after they received the official offer letter/email from their host university. This is to ensure that you can obtain your visa in time before the start of your exchange term. Your exchange at the host university depends on the clearance by the immigration of the host country. For more information on visa applications, please refer to the Korean Embassy website.",
  "accommodations_info": "Students who are interested in on-campus housing are encouraged to apply online as soon as the application is available. Please note that provision of on-campus housing is not guaranteed due to limited spaces. Rooms will be allocated on a first-come, first-served basis. Exchange students will be housed at the SK Global House (single and double occupancy) or the International House (only double occupancy). For more information about accommodation, please refer to http://ih.yonsei.ac.kr/ or contact: SK Global House: skghouse@yonsei.ac.kr, International House: ihouse@yonsei.ac.kr",
  "cost_of_living": "The estimated monthly living expenses breakdown is as follows:\n\n- Accommodation: ₩400,000 - ₩600,000\n- Food: ₩400,000\n- Transport: ₩100,000\n- Academic Expenses: ₩50,000\n- Others (Entertainment, clothes): ₩250,000\n\nMonthly Estimate: ₩1,200,000 - ₩1,400,000"
}
