{
  "university_name": "University of Illinois Urbana Champaign",
  "university_website": ["http://illinois.edu/", "http://illinois.edu/calendar/list/557", "https://isss.illinois.edu/students/incoming/pre_arrival/housing.html"],
  "university_country": "USA",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["FASS", "FoE", "FoS", "LAW"],
  "module_restrictions": "Restricted courses: College of Business (ACCY, BADM, and FIN courses), Department of Bioengineering, Department of Computer Sciences, Division of General Studies, Graduate College, School of Labor and Employment Relations, School of Information Sciences, College of Medicine, Department of Recreation, Sport, and Tourism (online graduate courses only), Technology and Information Management Program, College of Veterinary Medicine, any internships, co-op programs, or teaching practicums in local schools. Limited programs: Department of Advertising, Department of Mechanical Science and Engineering, Architecture (College of Fine & Applied Arts)—limited access to studio classes, College of Education, Electrical and Computer Engineering (College of Engineering), Department of Journalism, Kinesiology (College of Applied Health Sciences)—some limitations, Landscape Architecture (College of Fine & Applied Arts)—enrollment in studio classes must be pre-arranged.",
  "visa_info": "Once you are accepted to the exchange programme at UIUC, your admission packet will be shipped to NUS Registrar’s Office. The admission packet includes your University of Illinois welcome letter and Notice of Acceptance, and your DS-2019 (Certificate of Eligibility for Exchange Visitor Status). If you hold a J-1 visa status, please pay your SEVIS fee once you receive your DS-2019 from the University of Illinois. The SEVIS fee can be paid on the Department of Homeland Security website (I-901 fee). Remember to print the receipt to present at your visa interview. Schedule an appointment as early as possible for your non-immigrant entry visa with a U.S. Embassy. Please bring the required documents to your visa interview as listed on the embassy website. What you will need to show at the United States Port of Entry: Passport, Entry visa, Original DS-2019 (no copies).",
  "accommodations_info": "UIUC does not reserve housing for students. You are responsible for arranging your own housing. There are many housing options available to exchange students. For more information regarding housing options at UIUC, please refer here: https://isss.illinois.edu/students/incoming/pre_arrival/housing.html",
  "cost_of_living": "The estimated monthly living expenses for UIUC can be found at the following link: http://www.studyabroad.illinois.edu/incoming-students/incoming-student-finances/",
}
