{
  "university_name": "University of Maryland",
  "university_website": ["http://www.umd.edu/", "http://www.provost.umd.edu/calendar/"],
  "university_country": "USA",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["FASS", "FoS", "SoC"],
  "module_restrictions": "UMD is suitable for FASS, FoS and SoC students. However, SoC modules are limited at UMD. Students should plan to take two, possibly three CS modules, but have plenty of back-ups in mind.",
  "visa_info": "Once admitted to UMD, exchange students will request a DS-2019 Form using the International Student and Scholar Services office (ISSS) online portal, iTerp. The DS-2019 form is the immigration document required to apply for a J-1 Visa.\n\nProof of Financial Support\nYou will need to submit Proof of Financial Support to iTerp. The anticipated proof of finance amount that students need to show for the 2017-2018 academic year is:\n$15,750 minimum for students studying at UMD for the full year\n$7,000 minimum for students studying at UMD for one semester only.\nYou can demonstrate proof of financial support in the following ways:\nA bank statement on bank letterhead signed by a bank official with the applicant’s full name listed as the account holder (first and last name).\nIf the bank statement is not in the matriculating student's name, a letter of support must be submitted and signed by a sponsor stating that the sponsor is accepting full financial responsibility for the applicant accompanied by a bank statement on bank letterhead signed by a bank official with the sponsor’s full name listed as the account holder.\nA scholarship letter from the sponsoring organization listing the amount of the award and the student’s full name (first and last name).\nBank statements or letters must be dated within 6 months of the date the application is submitted. You cannot submit statements from investment accounts or loan agencies. It must be a regular checking or savings account from which applicants or sponsors can withdraw money at any time.",
  "accommodations_info": "For information on the cost of housing and dining plans available please visit the Department of Residence Life and Dining Services websites. You can also view the estimated cost of attendance as an exchange student at UMD.",
  "cost_of_living": "Tuition fees are waived for exchange students. For more information on the cost of attending UMD for a semester, please refer to the following link: https://www.financialaid.umd.edu/award_process/cost_of_attendance.html"
}
