{
  "university_name": "Free University Berlin (Freie Universität Berlin - FUB)",
  "university_website": ["https://www.fu-berlin.de/en/studium/international/studium_ausland/direkt/index.html", "https://www.fu-berlin.de/en/studium/studienorganisation/termine/index.html", "https://www.fu-berlin.de/vv/en/fb_archiv?id=411506&sm=411506", "http://www.sprachenzentrum.fu-berlin.de/en/sprachangebot/sprachen/deutsch/vorkurs_deutsch/index.html", "http://www.sprachenzentrum.fu-berlin.de/en/sprachangebot/sprachen/deutsch/index.html", "https://www.fu-berlin.de/en/studium/international/studium_fu/einreise_aufenthalt/visum/index.html", "http://www.fu-berlin.de/en/studium/international/studium_fu/einreise_aufenthalt/krankenversicherung/index.html", "https://myportal.nus.edu.sg/studentportal/student-insurance/all/", "https://nus.edu.sg/uhc/docs/default-source/insurance/frequently-asked-questions-on-covid-19.pdf", "https://www.fu-berlin.de/en/sites/coronavirus/index.html", "https://www.fu-berlin.de/en/sites/coronavirus/faq/index.html"],
  "university_country": "Germany",
  "sem1_months": ["OCT", "NOV", "DEC", "JAN", "FEB"],
  "sem2_months": ["APR", "MAY", "JUN", "JUL", "SEP"],
  "faculties_accepted": ["College of Humanities and Sciences (CHS)", "Faculty of Science (FoS)", "Faculty of Arts and Social Sciences (FASS)", "NUS Business School (BIZ)", "School of Computing (SoC)", "Faculty of Dentistry (DENT)", "College of Design and Engineering (CDE or FoE)", "Yong Loo Lin School of Medicine (YLLSOM)", "School of Law (LAW)", "School of Nursing", "Yong Siew Toh Conservatory of Music (YSTCM)"],
  "module_restrictions": "Enrolment in the Biochemistry, Bioinformatics and Biology is subject to availability of lab classes and to prior approval by the institute/department. Medicine and Veterinary Medicine are NOT open to exchange students. Restrictions apply in Pharmacy, Law and Economics and Business Administration. All master’s programmes (other than Modern German Literature, Philosophy and Political Science) are restricted and need prior approval by the institute/ department.",
  "visa_info": "EU citizens and citizens from the following countries do not need a visa to enter Germany: Australia, Canada, Honduras, Iceland, Israel, Japan, Korea, Liechtenstein, Monaco, New Zealand, Norway, San Marino, Switzerland and the United States. However, after entering Germany, you will have to apply for a residence permit at the local \"Auslaenderbehörde\" (Immigration Office) if you are staying for more than three months. Students from all other countries must apply for a visa for study purposes via the German diplomatic representation in their home country. You must not under any circumstances travel to Germany on a tourist visa.",
  "accommodations_info": "On-campus accommodation is not available. Further information about accommodation options will also be available to students via the Distributed Campus platform. Either students can organize their own private accommodation (such as student-shared apartments, so-called WG=Wohngemeinschaft) or use the university's accommodation service offered by the ERG GmbH. The accommodation service offers a variety of accommodation options, including dorms, shared flats and fully furnished single apartments. All housing options are available from the beginning of September/October or March/April onwards and cost about 300 – 850 € per month.",
  "cost_of_living": "The estimated monthly breakdown of costs is as follows:\n\n- Accommodation: €225 - €755\n- Insurance: €92\n- Food: €200\n- Others (Books, entertainment etc.): €200\n\nThe monthly estimate for living expenses ranges from €717 to €1,247. Exchange students will also need to pay social fees of approximately €270 per semester."
}
