{
  "university_name": "University of Gothenburg",
  "university_website": ["http://www.gu.se/english", "https://www.gu.se/en/study-in-gothenburg/when-you-are-here/academic-calendar", "https://www.gu.se/en/study-in-gothenburg/exchange-student", "https://www.gu.se/en/study-in-gothenburg/exchange-student/student/courses?hits=20", "https://www.gu.se/en/about-the-university/welcome-services/residence-permit-and-insurance", "https://www.migrationsverket.se/English/Private-individuals/Visiting-Sweden/Visiting-Sweden-for-studies-and-research.html", "https://www.gu.se/en/about-the-university/welcome-services/cost-of-living"],
  "university_country": "Sweden",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY", "JUN"],
  "faculties_accepted": ["Science", "Arts", "IT- Faculty", "Social Sciences", "Business, Economics and Law", "Fine arts, applied and performing arts", "Education", "Pharmacy"],
  "module_restrictions": "No specific module restrictions mentioned.",
  "visa_info": "If you are a citizen of a non EU/EEA country and are planning to stay for longer than three months, you need a residence permit before entering Sweden. You apply for a residence permit online or at the Swedish embassy or consulate in your home country. The process of getting your residence permit may take up to 12 weeks, so be sure to apply as soon as you receive your letter of acceptance. It is important that you have your residence permit card with you when entering Sweden. To obtain a residence permit you must have a valid passport, be admitted to full-time studies, be able to support yourself financially, and have a comprehensive health insurance if you are admitted to studies for less than one year.",
  "accommodations_info": "Applying for our services. Students should apply for housing after they have submitted their online application. Students will receive a unique housing application code once submitted their online application. Deadline for housing application is the same as the online application. No late applications can be accepted. Apply as soon as possible, since there is a great demand for housing. You do not have to be academically accepted before you apply online for non-academic services. The rooms and flats that we rent out are provided by SGS Studentbostäder, the local student housing company. Reservations and payment are managed by the university or by the local student housing company. Accommodation for exchange students is provided by the local student housing company, SGS Studentbostäder. All rooms come with a private bathroom and basic furniture, such as a desk, a bookshelf, a bed, chairs and lamps. Pillows, sheets, towels, kitchen utensils, light bulbs etc. are not provided. The rent includes electricity, water, heating, internet access (you will have to bring your own computer and network cable) and laundry facilities.",
  "cost_of_living": "Estimated Monthly Living Expenses: Accommodation: SEK4,000 – SEK7,000, Food: SEK3,000 – SEK4,000, Transport: SEK580, Telephone/Internet: SEK300, Others (Entertainment, clothes): SEK2,000. Monthly Estimate: SEK10,300 – SEK14,000."
}