{
  "university_name": "Stockholm University",
  "university_website": ["http://www.su.se/english/", "https://www.su.se/english/education/exchange-students"],
  "university_country": "Sweden",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY", "JUN"],
  "faculties_accepted": ["Faculty of Humanities", "Faculty of Social Sciences (excluding School of Business)", "Faculty of Science"],
  "module_restrictions": "Please note that for most courses there are special eligibility requirements which are determined by the departments. Students may choose any course in the study area named in the agreement, provided that they meet the prerequisites specified for each course. It is important that the home university approves the courses students plan to take at Stockholm University. Students should choose courses together with the department at the home university and the department at Stockholm University.",
  "visa_info": "Students from outside the EU/EEA must apply for a residence permit at the Swedish Embassy/Consulate in their country of residence, directly after receiving the headed admissions letter from Stockholm University. Applications for a residence permit can under no circumstances be submitted after entering Sweden. Students are strongly advised to apply as soon as they receive their Letter of Acceptance, since it may take up to three months to get the documentation finalised. The following documents are required:\n\n- A copy of a valid passport or ID-card\n- Letter of admission from Stockholm University stating the duration of studies\n- Proof that you can support yourself during your stay in Sweden (i.e. a bank statement in your name); the applicable minimum amount per month of stay is stipulated at the Swedish Migration Board website\n- A valid health insurance, if the duration of the programme is one year or less.",
  "accommodations_info": "As a special service Stockholm University tries to assist students from partner universities with accommodation. Stockholm University does not own any student dormitories and does not normally organise accommodation for students. A special exception is made for exchange students from universities with which Stockholm University has a signed co-operation agreement. The Housing Office at the International Exchange Unit manages a limited number of rooms in Stockholm. Unfortunately, due to the high demand and shortage of accommodation in Stockholm, it cannot guarantee accommodation for every exchange student. In order to be able to apply for housing you need to be an exchange student. Exchange students apply for accommodation on the general registration form or via the on-line application form for exchange students.",
  "cost_of_living": "The estimated monthly living expenses in Stockholm are as follows:\n\n- Accommodation: SEK4,000\n- Food: SEK2,000\n- Transport: SEK600\n- Telephone/Internet: SEK300\n- Others (Entertainment, clothes): SEK1,100\n\nThe monthly estimate for living expenses is SEK8,000."
}
