{
  "university_name": "University of Oslo",
  "university_website": ["http://www.uio.no/english/studies/admission/exchange/bilateral/index.html"],
  "university_country": "Norway",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY", "JUN"],
  "faculties_accepted": ["Humanities", "Social Sciences", "Educational Sciences", "Mathematics and Natural Sciences", "Theology", "Law"],
  "module_restrictions": "Courses within Nutrition and Health Sciences, Geoscience, courses at the University Centre in Svalbard and Psychology might have restrictions and prerequisites may apply. Courses with the codes ENG and NORAM tend to get fully booked quite fast, and Oslo degree-seeking students who have these courses as compulsory in their programme are given priority.",
  "visa_info": "All students are advised to apply for the necessary visa immediately after they received the official offer letter/email from their host university. Some visa application process could take up to 2 months to process. Your exchange at the host university depends on the clearance by the immigration of the host country.\nNon-EU/EEA-citizens\nStudents residing outside the European Economic Area must apply for a visa and residence permit immediately after they have received their Letter of Admission from the University of Oslo. All Non-EU/EEA students are advised to apply for a residence permit from home.\nHow to apply:\nFill in the application form for first time residence permit and apply through the nearest Norwegian Embassy/Consulate in your country of residence. (This is managed by VFS in Singapore.)\nBe sure to include the following documents together with the application form:\n- Passport and copy of all used pages in passport\n- 2 new/recent passport size photos with white background\n- A letter of full-time admission from an approved educational institution, stating your name, which studies you have admission to, at what level the studies are and how long the programme lasts\n- Documentation that you have sufficient funds\n- Documentation which shows that you have somewhere to live in Norway\n- UDI’s checklist\nYou must register with the Oslo Police, Foreign Section within 7 days after arrival.",
  "accommodations_info": "Prices for a single, furnished room vary from approximately NOK 2,200 to NOK 4,200 a month. International students are generally offered accommodation in the lower price range, where they share bathrooms (2-5 students) and kitchens (4-6 students). However, they may apply for transfer at a later date if they should wish to change their accommodation within the same category. Please note that family apartments or flats for students who wish to bring along their spouse or family cannot be guaranteed by SiO or the International Education Office. Students who wish to bring along their spouse or family have to find an apartment on the open market. These days, rents start at approx NOK 8,000 for a 2-room apartment in central Oslo.",
  "cost_of_living": "The estimated monthly living expenses are as follows:\n- Accommodation: NOK 3,500\n- Transport: NOK 600\n- Food: NOK 3,000\n- Others (Books, entertainment etc.): NOK 2,400\n\nThe monthly estimate for living expenses is NOK 10,500. More details can be found at http://www.uio.no/english/student-life/budget/"
}
