{
  "university_name": "University of Hawaiʻi at Mānoa",
  "university_website": ["http://hawaii.edu", "http://manoa.hawaii.edu/mix/#"],
  "university_country": "USA",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["BIZ", "FASS", "FoE", "FoS", "SDE", "SoC"],
  "module_restrictions": "Exchange/Visiting students are encouraged to maintain a flexible study plan with several alternate course selections to avoid disappointment if first-choice courses are unavailable. With the exception of specific course restrictions, and subject to prerequisite requirements, Exchange/Visiting students are free to select their courses. Students typically select courses within the academic area of their major at their home institution, although enrollment outside of your major is often possible, particularly with introductory-level courses that do not have prerequisites. Inbound exchange students are restricted from taking courses in Medicine, Law, Nursing, and Dental Hygiene. Graduate exchange students who want to take graduate level UHM courses in Second Language Studies (SLS) should have a TOEFL score of 100+. Students who want to take Business courses should already have a good foundation in business at their home university and a solid command of the English language, as normally demonstrated by a TOEFL score of 80+ (550+) or IELTS 6.5+.",
  "visa_info": "All international students (in F-1 and J-1 status) are required to begin the mandatory online Visa Clearance provided by UHM International Student Services (ISS). The online session is self-service and will take approximately 1 hour and 15 minutes to complete. Once you pass, download the certificate. The online visa clearance is only the first half of the process. To complete the visa clearance process, upon arriving in the US, you will need to sign up for a Visa Clearance Session, during which you will submit this certificate along with your passport, visa, DS-2019 or I-20, and J-1 Health Insurance Provider Form to the UHM International Student Services (ISS) Office for review. After your documents have been reviewed, you will be able to pick them up from the ISS Office. Failure to complete a Visa Clearance Session will result in a hold being placed on your MyUH course registration on the first day of instruction (but will not prevent you from registering in MyUH before the semester starts).",
  "accommodations_info": "On Campus Housing: Fall Semester – During the fall semester, there is a limited amount of on-campus housing available to international exchange students. Students coming to UHM for just the fall semester or for the academic year may apply for on-campus housing online, but are encouraged to explore off-campus housing options. Undergraduates are given preference for on-campus housing. Spring Semester – During the spring semester, on-campus housing is widely available. International exchange students coming to UHM for the spring semester or calendar year are welcome to apply for on-campus housing online, and have a high likelihood of being placed. Apply for On-Campus Housing – In order to apply for on-campus housing, you need a UH Number (found on your Acceptance letter). Students may apply for on-campus housing online at UHM Student Housing Services. There is a $25 application fee that should be paid with a credit card. Please be sure to use the “Non-Freshman” application form; do NOT use the “Freshman” application form. Please note that the housing contracts at UHM are for the entire academic year (two semesters). If you will only be studying at UHM for the Fall semester, that’s OK. We will inform Student Housing Services and later they will be able to release you from the second half of your contract. Off Campus Housing: Hawaii Student Suites – Several student-friendly properties, including “Beachwalk” apartments located one block from Waikiki Beach, and “Kalo Terrace” community dormitories located one block from the UHM campus. Off-Campus Housing Referral Program – This website lists several good options. The Off-Campus Housing Referral Program website includes much useful information, including links to temporary housing, hostels and other off-campus options. Applications and/or reservations would need to be sent/made as soon as possible to insure a space when you arrive. Prices vary as do application procedures. (To access the listings at the yellow “Students” link, UH username and password required.) East-West Center – Next to campus and has two housing facilities for students: Hale Manoa and Hale Kuahine. Both facilities are primarily reserved for graduate students formally affiliated with the East- West Center, but any students are welcome to apply. Space is limited, and priority will be given to students majoring in Asia-Pacific related studies.",
  "cost_of_living": "The University of Hawaii estimates that the monthly living expenses for international students are approximately $1,400-$2,000. This includes accommodation, meals, transportation, textbooks, and personal expenses. Please note that these are just estimates and actual expenses may vary depending on individual lifestyles and choices."
}
