{
"university_name": "Cornell University - College of Human Ecology (CHE)",
"university_website": ["http://www.cornell.edu", "https://www.cornell.edu/academics/calendar/", "https://www.human.cornell.edu/academics/policies/requirements", "https://classes.cornell.edu", "http://living.cornell.edu/live/wheretolive/co-ops/index.cfm", "https://www.cupolice.cornell.edu/", "https://finaid.cornell.edu/cost-attend"],
"university_country": "USA",
"sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
"sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
"faculties_accepted": ["Design + Environmental Analysis", "Human Development", "Nutritional Sciences", "Policy Analysis and Management", "Fiber Science & Apparel Design"],
"module_restrictions": "Please see the class roster for reference at https://classes.cornell.edu. IMPORTANT: Students are to write down subjects they are interested on the application form, yet it is only an 'indication of interest', even if the application is approved, it does not mean the subjects indicated on the application form are approved. Students will be asked to submit their choices for actual subject registration at a later date (dates to be confirmed in the admission letter) when the timetable is released and the list of subjects is finalized. Therefore, students are advised to identify as many suitable subjects as possible so that they can revise their subject selection easily if those they are interested in are not available.",
"visa_info": "All students are advised to apply for the necessary visa immediately after they receive the official offer letter/email from their host university. Some visa application processes can take up to 2 months to process. Your exchange at the host university depends on the clearance by the immigration of the host country. You will need a valid passport and student visa to enter the United States. Once accepted to the program and your file has been processed by admissions, you will receive a DS-2019 Form which is required to apply for your J-1 visa.",
"accommodations_info": "University Accommodation: In recent years, Cornell has experienced an increased demand for on-campus housing, and as a result, on-campus housing is not usually available for incoming exchange students. In the fall semester, there are usually no on-campus housing vacancies for exchange students—in rare cases, a few vacancies may become available—and in the spring semester, if any on-campus housing vacancies become available for exchange students, they will be very limited. In either case, exchange students would not be notified of any possible on-campus housing vacancies until very late, and exchange students should not apply for on-campus housing unless they are notified that there are some vacancies available. If on-campus housing becomes available, the Exchange Coordinator will contact students directly. Some students have been able to find housing in an alternative form of on-campus housing run by students called cooperative housing, but if any vacancies are available, they will also be very limited: http://living.cornell.edu/live/wheretolive/co-ops/index.cfm. Exchange Housing Program: We know finding a place to live in an unfamiliar city can be stressful, especially when trying to do so from another country. Therefore, for convenience, Cornell has established an exchange housing program to help incoming exchange students with their search for housing. Collegetown Terrace (vetted and viewed by Cornell staff) has an agreement with the Office of Global Learning to assist in placing incoming exchange students in apartments located just down the hill from the main campus area. Students can reach campus by bus (free) or within 15 minutes by walking. The apartments are fully furnished, include free wi-fi, on-site fitness, and in-apartment laundry. Rent for these apartments is billed to students Cornell account and there is no 12 month lease required. Off-Campus Housing: Students may choose to find their own housing off-campus. Incoming exchange students who wish to search for their own off-campus accommodation should refer to the resources listed in the learning content pages of their application. Exchange students should begin their search right away, and they should be aware that it is difficult to find one-semester leases near campus in the fall in comparison to the spring when there are usually quite a few sublets available. As a part of the application, students will receive more detailed information regarding the Exchange Housing program (application process, costs, etc.) and resources and tips to finding off-campus housing if preferred.",
"cost_of_living": "For more information on financial matters, please refer to the following link: https://finaid.cornell.edu/cost-attend. Information correct as of July 2021. Please refer to the Cornell/CHE links for the most up-to-date information."
}
