{
  "university_name": "Universidad Autónoma de Madrid",
  "university_website": ["https://www.uam.es/uam/inicio"],
  "university_country": "Spain",
  "sem1_months": ["SEP", "OCT", "NOV", "DEC", "JAN"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY", "JUN"],
  "faculties_accepted": ["Faculty of Philosophy and Liberal Arts", "Faculty of Law", "Faculty of Economical Science and Business Management", "Faculty of Sciences", "Faculty of Psychology", "Superior Polytechnic School"],
  "module_restrictions": "Students must apply for courses they wish to study through the learning agreement. First year courses are not open to exchange students. Some of the courses are extremely popular (economics, philosophy), places will be assigned in order of application. Students must enroll a minimum of 2 courses worth 6 ECTS each for a semester stay. If they would like to read more than 2 courses, at least 51% of the courses selected must belong to one faculty/school where you have been accepted (for example, 3 courses from 3 different schools will not be accepted, 2 courses must belong to one school, and the 3rd course can be taken at a different school).",
  "visa_info": "Students studying in Spain for longer than 3 months are required to obtain a student visa before travelling to Spain. Contact your local embassy for information. All students are advised to apply for the necessary visa immediately after they received the official offer letter/email from their host university. Some visa application process could take up to 2 months to process. Your exchange at the host university depends on the clearance by the immigration of the host country. For more information about visa, please refer to: https://www.uam.es/uam/en/internacional/visado-nie-tie http://www.exteriores.gob.es/Embajadas/SINGAPUR/en/Embajada/ServiciosConsulares/Pages/Visas.aspx",
  "accommodations_info": "UAM does not provide accommodation for our incoming students. However, we could help you with some information about lodging in Madrid: In the Campus of Cantoblanco you have the option of staying at Residencia Universitaria Erasmo (managed privately). The UAM also offers housing with the Colegio Mayor Juan Luis Vives, which is located in Plaza de Castilla, which allows an easy commute to the campus. For more information on Accommodation, please refer to https://www.uam.es/uam/en/internacional/alojamiento\n\nii) Private Accommodation\nThe UAM has collaboration agreement with some housing companies: ALUNI and UNIPLACES. Off campus, there are other non-university residences such as: Residencia de estudiantes Ciudad Escolar (mixed), Masterhome residencia, and www.nexoresidencias.com. Finally, you always have the option to rent an accommodation by visiting the sites that manage the housing market in Madrid: http://www.fotocasa.es/ and http://www.segundamano.es/",
  "cost_of_living": "The estimated monthly living expenses in Madrid are as follows:\n\n- Accommodation: €470 - €570 + utilities\n- Food: €350 - €750\n- Transport: €60 - €70\n- Insurance: €100 - €150\n- Others (Entertainment, clothes): €100 - €200\n\nMonthly Estimate: €1,080 - €1,740"
}
