{
  "university_name": "University of Zagreb",
  "university_website": [
    "http://www.unizg.hr/homepage/"
  ],
  "university_country": "Croatia",
  "sem1_months": [
    "OCT",
    "NOV",
    "DEC",
    "JAN",
    "FEB"
  ],
  "sem2_months": [
    "FEB",
    "MAR",
    "APR",
    "MAY",
    "JUN"
  ],
  "faculties_accepted": [
    "FASS",
    "FoS",
    "CDE",
    "SoC",
    "LAW"
  ],
  "module_restrictions": "Business, Law and Military Studies modules at the University of Zagreb are not opened to NUS students participating in the Exchange Programme in Zagreb. Economics modules offered at University of Zagreb reside at the Faculty of Economics and Business. The Economics modules are more literature-based and not mathematical or statistical-based.",
  "visa_info": "Singapore passport holders may enter Croatia with a valid passport before applying for a residence permit in Zagreb. Students are advised to check with the Croatian embassy on the documentation required and bring them along with you. Students coming from a country that has a visa-regime with Croatia will be required to apply for a visa via the Croatian embassy in their home county before departing for Croatia. Students who need an entry visa to the Republic of Croatia need to regulate their residence permit before coming to Zagreb at the nearest Croatian embassy. Students who are not obliged to possess a visa to enter the Republic of Croatia may stay in Croatia for a maximum of 90 days within a period of 6 months, starting from the day of their first entry. Exchange students staying in Croatia for more than 90 days are obliged to apply for the approval of the temporary stay for the purpose of studies (dozvola boravka) within 48 hours of their arrival.",
  "accommodations_info": "The University of Zagreb does not guarantee that exchange students are given accommodation in the student residences. Exchange students may choose between organized accommodation in the 3 student hall of residence and will need to apply for it. All rooms are on a twin-sharing basis (there is no option to stay in a single room). The bathroom is shared. Cutlery and utensils are not provided. Complimentary Internet access is provided for all rooms.",
  "cost_of_living": "The cost of living in Zagreb varies depending on the individual lifestyle and spending habits. On average, students can expect to spend around [estimated monthly living expenses]. This includes accommodation, meals, transportation, textbooks, and other personal expenses. It is recommended to set aside a sufficient budget to cover living expenses for the duration of the exchange program."
}