{
  "university_name": "Rheinische Friedrich-Wilhelms-Universität Bonn (University of Bonn)",
  "university_website": ["www.studyabroad.uni-bonn.de", "https://www.uni-bonn.de/studying/international-students/study-abroad-in-bonn/jyp/academic-calendar", "https://www.uni-bonn.de/studying/international-students/short-term-junior-year-and-exchange-programs/jyp/courses/university-courses", "www.basis.uni-bonn.de", "www.studentenwerk-bonn.de/wohnen/"],
  "university_country": "Germany",
  "sem1_months": ["OCT", "NOV", "DEC", "JAN"],
  "sem2_months": ["APR", "MAY", "JUN", "JUL"],
  "faculties_accepted": ["FASS", "FoS"],
  "module_restrictions": "Modules offered by Bonn’s medical school is not open to exchange students.",
  "visa_info": "EU citizens and citizens from the following countries do not need a visa to enter Germany: Australia, Canada, Honduras, Iceland, Israel, Japan, Korea, Liechtenstein, Monaco, New Zealand, Norway, San Marino, Switzerland and the United States. However, after entering Germany, you will have to apply for a residence permit at the local 'Auslaenderbehörde' (Immigration Office) if you are staying for more than three months. Students from all other countries must apply for a visa for study purposes via the German diplomatic representation in their home country. You must not under any circumstances travel to Germany on a tourist visa.",
  "accommodations_info": "Students will be housed in one of several student dorms, which are located in different areas of town. All dorms are easily accessible either by foot or by public transportation. All rooms are single rooms. Some are equipped with a kitchenette and a private bathroom while others have shared facilities. Rent is about €200-350 per month. Meals are not included. Students who have a contract that ends in August or September are expected to pay for the rental until August or September. There will be no refund of the rental if you leave the student accommodation earlier.",
  "cost_of_living": "The estimated breakdown of monthly living expenses is as follows:\n- Accommodation (student form): €200-€400\n- Insurance: €90-€95\n- Food: €165\n- Others (Books, entertainment etc.): €210\n\nMonthly Estimate: €665-€870\n\nThere is a semester social fee of €300 which includes public transportation in Germany. In order to receive a residence permit, you need to present to the Ausländerbehörde (local foreigner’s registration office) a statement of financial support proving that you have at least €735 to live on for each month of your stay."
}
