{
  "university_name": "University of Innsbruck",
  "university_website": [
    "https://www.uibk.ac.at/international-relations/exchange-students-incoming/",
    "https://www.uibk.ac.at/international-relations/erasmus/incoming/academic_calendar.html",
    "https://orawww.uibk.ac.at/public/lfuonline_lv.home",
    "https://housing.oead.at/en/accommodation/innsbruck-en",
    "https://www.bmeia.gv.at/en/travel-stay/entry-and-residence-in-austria/entry-and-visa/visa-d/",
    "http://www.nus.edu.sg/uhc/healthservice/insurance-schemes/undergraduate-scheme.html",
    "http://www.nus.edu.sg/finance/InsuranceCoverforOfficialNUSTrips.html",
    "http://www.uibk.ac.at/international-relations/erasmus/incoming/guide-englisch.pdf",
    "https://www.uibk.ac.at/international-relations/erasmus/incoming/general_information.html",
    "http://innsbruck.esnaustria.org/"
  ],
  "university_country": "Austria",
  "sem1_months": [],
  "sem2_months": [
    "MAY",
    "JUN"
  ],
  "faculties_accepted": [
    "FASS",
    "CDE",
    "FoS"
  ],
  "module_restrictions": "Exchange students who are not nominated as Business students are discouraged from taking any Business or Economics courses offered at the Innsbruck’s School of Management. Innsbruck’s International Economic and Business Studies Office (IWW – office) is a separate office and therefore requires separate nomination, application and processing. Students who wish to apply for courses from University of Innsbruck and from IWW have to be nominated twice, applied through two different application portals managed by Innsbruck and IWW and subjected to all restrictions from both Innsbruck and IWW. It is not possible to be registered for both Bachelor and Master programme and taking modules at both Bachelor and Master level in Innsbruck at the same time. NUS students applying for master courses at Innsbruck must include a copy of their bachelor certificate and transcripts of records of Bachelor programme.",
  "visa_info": "All students are advised to apply for the necessary visa immediately after they received the official offer letter/email from their host university. Some visa application process could take up to 2 months to process. Your exchange at the host university depends on the clearance by the immigration of the host country. Exchange students who will be going for exchange for up to 6 months will have to apply for Apply for Visa-D (long-term visa – for stay of more than 90, but less than 180 days. Single entry / multiple entry). More information at https://www.uibk.ac.at/international-relations/exchange-students-incoming/preparation-arrival-in-ibk/#visa%20application",
  "accommodations_info": "Finding accommodation may be challenging in Innsbruck. Students should apply as soon as possible to get a room in a student home (Studentenheim). Summer term: application recommended in September",
  "cost_of_living": "The estimated monthly living expenses in Innsbruck are as follows: Accommodation: €350 - €450, Food: €250 - €400, Transport: €130, Books, entertainment, etc.: €100 - €200. The monthly estimate ranges from €830 - €1,180. [Details can be found at http://www.uibk.ac.at/international-relations/erasmus/incoming/guide-englisch.pdf]"
}
