{
  "university_name": "Zhejiang University",
  "university_website": [
    "http://www.zju.edu.cn/english/19600/list.htm",
    "https://www.zju.edu.cn/english/2018/0521/c19594a812608/page.htm",
    "https://www.intl.zju.edu.cn/en",
    "https://www.zju.edu.cn/english/19598/list.htm",
    "http://iczu.zju.edu.cn/english/redir.php?catalog_id=21694",
    "https://www.visaforchina.cn/SGP2_EN/index.shtml",
    "https://www.visaforchina.cn/#/guideNav/Guidance?visacenterCode=SGP2&request_locale=en_US&site_alias=SGP2_EN",
    "https://myportal.nus.edu.sg/studentportal/student-insurance/all/",
    "http://www.zju.edu.cn/english/19997/list.htm",
    "https://www.zju.edu.cn/english/2018/0523/c19996a813004/page.htm"
  ],
  "university_country": "China",
  "sem1_months": ["SEP", "OCT", "NOV", "JAN"],
  "sem2_months": ["FEB", "MAR", "APR", "MAY", "JUN", "JUL"],
  "faculties_accepted": ["FASS", "FoS", "CDE", "SoC", "LAW"],
  "module_restrictions": "Students are required to have some basic knowledge or record of course learning for some advanced-level courses.",
  "visa_info": "Exchange students in China are required to apply for student visa (X2 visa for those intending to study in China for a period of no more than 180 days and X1 visa for those intending to study in China for a period of more than 180 days). You will receive the admission letter and visa application form (JW202) once you are accepted by the host university for the student exchange programme. Exchange students are required to apply for the student visa in person at the China Visa Application Service Centre in Singapore with the relevant documents before the start of the academic semester.",
  "accommodations_info": "ZJU reserves on-campus accommodation for exchange students near the campus where the student specialty college/department is located. The cost is approximately RMB1,500 per person per month on a twin-sharing basis. Exchange students are usually allowed to check-in within three days before the date of registration. A RMB800 refundable room deposit is required upon checking-in.",
  "cost_of_living": "The cost of living in Zhejiang University varies depending on individual preferences and lifestyle. On average, the monthly expenses including accommodation, meals, transportation, and miscellaneous costs range from RMB3,000 to RMB5,000. Additional costs may include visa fees, insurance, and personal expenses."
}
