{
  "university_name": "Tongji University",
  "university_website": [
    "https://study.tongji.edu.cn/English/CURRENT_STUDENTS/Calendar.htm",
    "https://fao.tongji.edu.cn/faoenglish/7498/list.htm",
    "https://is.tongji.edu.cn/10289/list.htm",
    "https://caup.tongji.edu.cn/caupen/11069/list.htm",
    "https://www.visaforchina.cn/SGP2_EN/index.shtml",
    "https://www.visaforchina.cn/#/guideNav/Guidance?visacenterCode=SGP2&request_locale=en_US&site_alias=SGP2_EN",
    "https://study.tongji.edu.cn/English/CURRENT_STUDENTS/Visa___Residence_permits.htm",
    "https://myportal.nus.edu.sg/studentportal/student-insurance/all/",
    "http://www.lxbx.net",
    "http://fao.tongji.edu.cn/4120/list.htm",
    "https://study.tongji.edu.cn/English/HOME.htm",
    "https://is.tongji.edu.cn/"
  ],
  "university_country": "China",
  "sem1_months": ["SEP", "OCT", "NOV", "JAN"],
  "sem2_months": ["FEB", "MAR", "APR", "MAY", "JUN", "JUL"],
  "faculties_accepted": ["College of Architecture and Urban Planning", "School of Economic and Management", "College of Design and Innovation", "College of Civil Engineering", "Faculty of Humanities and Sciences (CHS)", "Faculty of Science (FoS)", "College of Design and Engineering (CDE or FoE)", "School of Computing (SoC)", "School of Law (LAW)"],
  "module_restrictions": "Modules offered by the Chinese-German Institute for Applied Sciences are not available to exchange students.",
  "visa_info": "Exchange students in China are required to apply for a student visa (X2 visa for those intending to study in China for a period of no more than 180 days and X1 visa for those intending to study in China for a period of more than 180 days). You will receive the admission letter and visa application form (JW202) once you are accepted by the host university for the student exchange programme. Exchange students are required to apply for the student visa in person at the China Visa Application Service Centre in Singapore with the relevant documents before the start of the academic semester.",
  "accommodations_info": "There are four dormitory buildings for international students located in three campuses (Siping, Zhangwu, Jiading campuses). Basically two students share one room and the cost. Each room is equipped with a toilet, shower, and air-conditioner. Each floor has a public kitchen equipped with a microwave oven and induction cooker. In addition, you can also use self-service laundry conveniently. For exchange students nominated at the University-wide level, students will be guaranteed a twin-sharing room during the semester by Tongji University. This arrangement is not guaranteed over semester breaks. Please confirm with the service center at the on-campus accommodation directly.",
  "cost_of_living": "The cost of living in China varies depending on the location and personal lifestyle. It includes expenses such as accommodation, meals, transportation, entertainment, and personal expenses. On average, the cost of living for a student in China is estimated to be around RMB 5,000 to RMB 15,000 per semester. This cost may be subject to the country and local conditions at the overseas Partner University during the period of exchange."
}
