{
  "university_name": "University of Leeds",
  "university_website": ["https://www.leeds.ac.uk/international-exchange-and-study-abroad", "https://www.leeds.ac.uk/secretariat/almanac.html", "https://www.leeds.ac.uk/info/130117/exchange_and_study_abroad/119/language_requirement", "https://www.leeds.ac.uk/international-exchange-and-study-abroad/doc/applying", "https://www.leeds.ac.uk/international-students/doc/coronavirus-information-applicants-offer-holders", "http://students.leeds.ac.uk/info/21504/living_in_the_uk/842/budget_and_costs", "http://www.leeds.ac.uk/info/130117/exchange_and_study_abroad/148/preparation_and_arrival"],
  "university_country": "United Kingdom",
  "sem1_months": ["Late", "September", "to", "late", "January"],
  "sem2_months": ["Late", "January", "to", "mid-June"],
  "faculties_accepted": ["Faculty of Arts. Humanities and Cultures", "Faculty of Engineering", "Faculty of Biological Sciences", "School of Business", "School of Environment", "School of Mathematics and Physical Sciences"],
  "module_restrictions": "Graduate modules are not open to undergraduate exchange students. Studio Art, Design and Music Performance modules may not be available to exchange students. For highly popular modules, early application is strongly recommended to avoid disappointment. There are a number of other module restrictions so it is advised that the search parameter ‘Search by Incoming Study Abroad’ is used to obtain an accurate list of what is available. Leeds would also advise students to read the school-specific module guidance here.",
  "visa_info": "UK Visa and Immigration updates their immigration policy regularly. It is the student’s responsibility to check on the requirements via their website before they leave for the exchange. Standard Visitor Visa for Semester Exchange: If you are a Singapore citizen or a citizen of another country on the UK non-visa nationals list, and if your course of studies is less than 6 months, you will request entry to the UK as a Standard Visitor when you arrive. Singapore citizens do not normally need to meet with a Border Force agent, and will be able to enter the UK through E-gates. The E-gates will automatically grant you permission to stay in the UK for up to 6 months. You will not receive a stamp on your passport thus it is important that you retain evidence of when you entered the UK. Hence, please keep your boarding pass or evidence of your flight itinerary. Student Visa for Full-Year Exchange: You need a Student Visa for a full-year exchange in Leeds.",
  "accommodations_info": "Information about university accommodation will be given in the acceptance email sent out by Leeds directly to selected students. Accommodation is guaranteed for all exchange students at the university provided that the application is received by the university's accommodation office before the given deadline. Students can apply for accommodation from mid-May after formally accepted by Leeds for the exchange. For details on the various housing options and rental, please refer here.",
  "cost_of_living": "The estimated monthly living expenses can be found at http://students.leeds.ac.uk/info/21504/living_in_the_uk/842/budget_and_costs. The breakdown and total cost of living can vary depending on personal preferences and lifestyle choices."
}