{
  "university_name": "University of Lausanne",
  "university_website": ["https://www.unil.ch/central/en/home.html"],
  "university_country": "Switzerland",
  "sem1_months": ["SEP", "OCT", "NOV", "DEC", "JAN"],
  "sem2_months": ["FEB", "MAR", "APR", "MAY", "JUN", "JUL"],
  "faculties_accepted": ["Faculty of Theology and Religious Studies", "Faculty of Law and Criminal Justice", "Faculty of Arts", "Faculty of Social and Political Sciences", "Faculty of Business and Economics", "Faculty of Geosciences and Environment", "Faculty of Biology and Medicine"],
  "module_restrictions": ["School of Medicine (except specific SEMP agreements)", "School of Criminal Justice (except Master of Law in Criminology and Security; for courses of the Bachelor and Master in Forensic Sciences, a written request must be addressed to the Direction of the School).", "MSc in Medical Biology", "MSc in Accounting, Control and Finance", "Some courses may require specific prerequisites and the approval of the Master programme’s director", "Executive programmes (EMBA, MAS, etc.)"],
  "visa_info": "Students should apply to the Swiss diplomatic representation in their own country in order to complete the necessary administrative procedure. It is very important that these formalities are started within the time limits set, i.e. 2 to 3 months before their arrival in Switzerland. It is impossible to change a tourist visa into a student permit once the student has arrived in Switzerland. If you need to apply for a visa:\n\n1. Go to the nearest Swiss embassy or consulate\n2. Bring with you:\n\ta. A general outline of your study project with the length of\n\tyour studies\n\tb. A valid passport\n\tc. An acceptance letter from University of Lausanne\n\td. An official guarantee of your ability to finance your studies in\n\tSwitzerland\n\nPlease apply for your visa as soon as your receive your acceptance letter\nfrom UNIL. The visa procedure can take up to 3 months to complete.\n\nUpon arrival in Switzerland, the student must go personally to the Foreign\nRegistration Office (Bureau des etrangers) of his/her town of residence to\nget a Residence Permit. The cost of a Residence Permit is CHF 150 – 280 for\nstudents from non-EU countries, depending on the municipality of\nresidence. There is also a residence tax of CHF 30 – 37/month depending on\nthe town of residence.\n\nFor more information on visa: https://www.unil.ch/international/comingtolausanne",
  "accommodations_info": "UNIL cannot guarantee housing for all exchange students. Priority is given\nto overseas exchange students. University halls of residence are open to\nbachelor and master students only. Advanced studies and continuing\neducation students (Master of Advanced Studies) have no access to\nuniversity halls of residence. Students who did not get a room through our\noffice can ask for a room rent list.\nFor more information about accommodation, please refer to\nhttps://www.unil.ch/international/comingtolausanne",
  "cost_of_living": "The estimated monthly living expenses in Lausanne are as follows:\n\n- Accommodation: CHF500 – CHF750\n- Food: CHF600\n- Transport: CHF80\n- Insurance: CHF100\n- Others (Entertainment, clothes): CHF500\n\nThe monthly estimate for living expenses is CHF1,900."
}
