{
  "university_name": "ETH Zurich (Swiss Federal Institute of Technology)",
  "university_website": [
    "http://www.ethz.ch/",
    "https://www.ethz.ch/en/studies/non-degree-courses/exchange-and-visiting-studies/programmes/exchange-programmes/worldwide-programmes.html",
    "http://www.exchange.ethz.ch/"
  ],
  "university_country": "Switzerland",
  "sem1_months": ["SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["FEB", "MAR", "APR", "MAY", "JUN"],
  "faculties_accepted": [
    "Department of Agriculture and Food Sciences",
    "Department of Architecture",
    "Department of Civil, Environmental and Geomatic Engineering",
    "Department of Biology",
    "Department of Biosystems Science and Engineering",
    "Department of Chemistry and Applied Biosciences",
    "Department of Earth Sciences",
    "Department of Computer Science",
    "Department of Information Technology and Electrical Engineering",
    "Department of Mathematics",
    "Department of Materials Science",
    "Department of Mechanical and Process Engineering",
    "Department of Physics",
    "Department of Environmental Sciences"
  ],
  "module_restrictions": "Exchange students will be enrolled in one department as non-degree students, but they may pick and choose courses from different curricula, departments, and years. As a general rule, 2 thirds of the courses have to be taken in the department of enrolment. Exchange students are expected to acquire a minimum of 20 ECTS (not including the language course/s). The full workload for regular ETH students is 30 ECTS per semester. Study plans and selected courses are subject to approval by the departmental exchange coordinator of the department of enrolment at ETH Zurich. Courses ending with –AAL are not open to exchange students. Modules from the department of Management, Technology and Economics (D-MTEC) are not open to NUS exchange students. Biology (D-BIOL): For block courses, there is an internal registration procedure and places are limited. Note that block courses are very difficult to combine with courses from other study programmes, they are intended only for combination with the Departments’ concept courses. More information can be found on the website of D-BIOL. Computer Science (D-INFK): Especially the Department of Computer Science has recently defined their admission criteria in a more specific but also somewhat more restrictive manner. Their respective conditions for the admission of exchange students can be found on their website. Humanities, Social and Political Sciences: No enrolment is possible in the department of Humanities, Social and Political Sciences (D-GESS), incoming students may only take individual courses (max. 1/3 of all courses/ECTS) as electives. Management, Technology and Economics: Students applying to the department of management, technology, and economics (D-MTEC) must have completed their Bachelor's degree in the field of mechanical engineering, electrical engineering, information technology, natural sciences, or any other equivalent field of study. In order to be accepted in the department of Mathematics (D-MATH) at ETH Zurich, a student must be enrolled for a degree in mathematics in their home university. Please note that courses offered by the department of Mechanical and Process Engineering (D-MAVT) in the category Engineering Tools, Laboratory Practice, Focus Project, and Workshop Floor are not allowed for incoming mobility students. Enrollment is not possible in the department of Humanities, Social and Political Sciences (D-GESS) and students can only take the department’s courses as electives (max. 1/3 of courses). Please note that the department of Biosystems Science and Engineering (D-BSSE) is located in Basel, a city approximately 100 km away from Zurich, therefore the services of the Student Exchange Office might be slightly limited.",
  "visa_info": "All visa applications are processed by ETH Zurich. Students will be informed after their acceptance about the further procedures. Everyone staying for more than 90 days (irrespective of whether they required a visa or not) is required to obtain a residence permit. Instructions on how to apply for it will be provided to students when they register in person at our helpdesk. Students need to follow the instructions and apply for their residence permit within 14 days after arrival. Important: The exact duration of the residence permit is calculated from the day of entrance to Switzerland and according to the duration of studies confirmed by ETH Zurich in the official confirmation of acceptance. Students should therefore never enter Switzerland before the start date stated on their official confirmation of acceptance. Otherwise, they risk their residence permit expiring before the last day of their planned mobility stay and not being able to write their final exams or finish their project/thesis work. In such case, they would have to apply for an extension of their residence permit at a charge. This applies to all non-EU/EFTA nationals, with and without a visa requirement, even if the visa authorization or the issued visa theoretically allows an earlier entry to Switzerland! Visa and residence permit fees usually amount to approx. CHF 400.",
  "accommodations_info": "Student accommodation in Zurich is available through the Foundation for Student Housing. The Housing Office of the University and ETH Zurich brokers accommodation on the private market. ETH Zurich has limited reserved housing for international students. Single rooms are common. You find offers with or without cooking facility, apartment sharing, cleaning and washing service, and bedding. All student accommodation in the city and the suburbs is located no further than 30 minutes from campus by using public transportation. Housing is not guaranteed, but so far ETH has usually been able to find accommodation for all overseas exchange students who registered with ETH’s Housing Office within the set deadlines. After acceptance, students will receive information on registering for accommodation by email. They should read this information carefully and apply online within the set deadlines. Please note: Students coming for research projects can only apply for housing if they are staying for the regular semester dates. Students older than 28 years cannot be accommodated in our student housing. Housing for students coming in the autumn semester is only available until 31 January and therefore not for the entire duration of the session examinations. Students staying for the full duration of the session examinations and having examinations in February would need to find alternative housing on their own for those 2-3 weeks. We may only be able to offer some partial financial support (subject to availability), yet this may not cover the full additional costs. Should a student initially only apply for one semester of exchange and then later on wish to extend for another semester, we may not be able to provide accommodation, i.e. the student may need to find something on his or her own.",
  "cost_of_living": "Estimated Monthly Living Expenses:\n\n- Accommodation: CHF 450 - CHF 850\n- Food: CHF 500\n- Transport: CHF 60 - CHF 90\n- Others (Entertainment, clothes): CHF 425\n\nStudents should budget approximately CHF 1,750 per month (requirement of migration authorities)."
}
