{
  "university_name": "Purdue University",
  "university_website": ["http://www.purdue.edu/", "https://www.purdue.edu/IPPU/SA/Incoming/index.html"],
  "university_country": "USA",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["FASS", "FoS", "CDE", "SoC", "LAW"],
  "module_restrictions": "Aviation, Education, Nursing, Pharmacy, and Vet Med.",
  "visa_info": "Purdue University issues J-1 student visas to exchange students. The student's U.S. immigration document (DS-2019) will be prepared by the Office of International Students and Scholars after the exchange application has been processed. Typically, this takes 4-6 weeks. The immigration document and a general information packet is sent directly to the exchange program coordinator, who forwards it to the student. The packet includes information about Purdue University, visa documentation, the international student orientation, and health insurance. All international students must pay the required SEVIS fee to the United States Department of Homeland Security per the instructions sent with the immigration document (DS-2019). It is not possible to pay the SEVIS fee before receiving the DS-2019.",
  "accommodations_info": "On-campus housing: After students have been admitted and assigned a Purdue identification number (PUID), they can apply online for on-campus accommodation. As soon as an exchange student is admitted, the Study Abroad Office sends an email explaining exactly how to apply online for housing. Note the following: Click here to read more about the services of the Purdue housing office, including descriptions of the available residences. Housing fees will be charged to the student's university account and can be paid by check or money order at the Bursar Office, by wire transfer, or online (there is a convenience fee of 2.75% if paid by credit card). University Residences charges a $100 non-refundable housing application fee, but exchange students don't need to pay this fee until they arrive at Purdue. Single rooms are not available to undergraduate students during the fall semester. Off-campus housing: The Study Abroad Office does not have the resources to assist exchange students locate off-campus accommodation. However, we suggest that students read about off-campus housing services at the Dean of Students' website or visit the office in Room 207 of Schleman Hall.",
  "cost_of_living": "Exchange students will be responsible for any expenses (other than tuition and fees) that are incurred during their stay at Purdue. Approximate expenses for one semester are $7,230 USD for room & board, books, and personal expenses. For more information regarding financial matters, please refer to the section 'Estimated Semester Expenses' found at the following link: https://www.purdue.edu/IPPU/SA/Incoming/index.html"
}
