{
  "university_name": "Ruprecht Charles University of Heidelberg",
  "university_website": ["https://www.uni- heidelberg.de/courses/prospective/admission_int/guide/online_guide_index.html"],
  "university_country": "Germany",
  "sem1_months": ["OCT", "NOV", "DEC"],
  "sem2_months": ["APR", "MAY", "JUN", "JUL"],
  "faculties_accepted": ["CHS", "FoS", "FASS", "BIZ", "SoC", "DENT", "CDE", "YLLSOM", "LAW"],
  "module_restrictions": "Please note that modules from Faculty of Medicine and Faculty of Dentistry are not open to exchange students. Access to courses in Biosciences and Law is restricted.",
  "visa_info": "EU citizens and citizens from the following countries do not need a visa to enter Germany: Australia, Canada, Honduras, Iceland, Israel, Japan, Korea, Liechtenstein, Monaco, New Zealand, Norway, San Marino, Switzerland, and the United States. However, after entering Germany, you will have to apply for a residence permit at the local 'Auslaenderbehörde' (Immigration Office) if you are staying for more than three months. Students from all other countries must apply for a visa for study purposes via the German diplomatic representation in their home country. You must not under any circumstances travel to Germany on a tourist visa.",
  "accommodations_info": "Student residences at Heidelberg University are administered by the Studierendenwerk, an independent organization providing various services to the student population. Although the number of available rooms is quite limited, the Akademisches Auslandsamt cooperates with the Studierendenwerk to secure rooms in student residences for international exchange students coming to Heidelberg. In some of the dormitories, internet access is available but cannot be guaranteed. Further, the internet access in the dorms is usually cable-bound and only a few have wireless LAN access. Internet access is not available in some dormitories located in Heidelberg’s old town. Students who prefer to live in private accommodation can receive information about private rooms and apartments in the area through the accommodation service at the Akademische Auslandsamt. Please note that private sector rents are considerably higher than rents in student residences.",
  "cost_of_living": "The estimated monthly living expenses in Heidelberg are as follows:\n\nAccommodation (for a dorm room): €220 - €350\nFood: €170 - €220\nInsurance (with state health insurance provider): €91\nOthers (Entertainment, clothes, telecommunication): €65 - €200\n\nMonthly Estimate: €746 - €861. In order to receive a residence permit, you need to present to the Ausländerbehörde (local foreigner’s registration office) a statement of financial support proving that you have at least €735 to live on for each month of your stay. This can either be a bank statement, a notarized parental letter, or a scholarship certificate.",
  "other_useful_info": ["Online guide for exchange students: http://www.uni-heidelberg.de/courses/prospective/admission_int/guide/online_guide_index.html",
    "COVID-19 related information: https://www.uni-heidelberg.de/en/newsroom/measures-of-the-university-for-protection-against-the-coronavirus",
    "Last updated: 2021. Note: All information is subject to change."]
}