{
  "university_name": "Rice University",
  "university_website": [
    "http://www.rice.edu/",
    "https://abroad.rice.edu/prospective-students"
  ],
  "university_country": "USA",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["FASS", "FoS", "FoE", "SoC"],
  "module_restrictions": "Courses in the Jesse H. Jones Graduate School of Management, the Shepherd School of Music, and the School of Architecture are not available to exchange students unless they are offered specifically to non-major undergraduates.",
  "visa_info": "Upon receiving your DS-2019, you will need to apply for your J-1 visa at a U.S. consulate or embassy. We recommend you visit the website of the US Embassy/Consulate where you wish to apply for your visa, and follow the procedures for documentation, interview request, etc. In general, you will need to present:\n\n1. A valid passport from your own government.\n2. A \"Certificate of Eligibility\" for a temporary stay in the U.S. (Form DS-2019 by Rice University or another sponsor).\n3. Financial documents to prove you have the funds required for at least a year’s stay in the U.S. (as indicated on the DS-2019).\n4. Proof of payment of the SEVIS fee. All J-1 visa applicants need to pay the one time SEVIS fee prior to applying for a visa. Keep your receipt as proof of payment to present to the US Consulate, port of entry officials when entering the U.S., OISS upon check-in, and for your records. For more information visit: www.FMJfee.com.\n5. Completed visa application forms – be sure to indicate your name as stated on your passport and your DS-2019 documents to better ensure that your name on your visa stamp will be displayed properly.",
  "accommodations_info": "On-campus housing: automatic placement for admitted students (no separate application needed). For more information on Rice’s Residential Colleges, please refer here: https://housing.rice.edu/",
  "cost_of_living": "For more information on the cost of attending Rice university, please refer to the following page: https://ga.rice.edu/undergraduate-students/student-services-organizations/tuition-fees-expenses/"
}
