{
  "university_name": "Boston University",
  "university_website": [
    "http://www.bu.edu",
    "http://www.bu.edu/abroad/international-exchange-students-at-bu/"
  ],
  "university_country": "USA",
  "sem1_months": ["SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["FASS", "FoE", "FoS", "SoC"],
  "module_restrictions": "Exchange students may not enrol in courses offered at the BU Medical School, School of Dental Medicine, Law School, Graduate School of Management, and Kilachand Honors College.",
  "visa_info": "All students are advised to apply for the necessary visa immediately after they receive the official offer letter/email from their host university. Some visa application processes can take up to 2 months to process. Your exchange at the host university depends on the clearance by the immigration of the host country. If you are traveling on a passport issued by a country other than the USA, you should check with the nearest consulate of the country to which you are traveling or transferring through on a connecting flight in order to determine whether a visa will be required. Do this as far in advance as possible and notify our office of the documentation you will need to apply for your visa. Also check with the local consulate of your home country to determine whether there are any passport or travel regulations of which you need to be aware. Investigate whether you will need to apply for a new visa to re-enter the United States, if you plan to do so upon completion of the program. The Boston University Office of International Students and Scholars (ISSO) administers visa documentation. International students who are accepted to a BU exchange program must obtain a J-1 visa. Upon acceptance, the ISSO will issue each exchange student a SEVIS Form DS-2019. Students must bring the form to the nearest American Embassy/Consulate in their country to obtain a visa.",
  "accommodations_info": "Upon acceptance exchange students will receive a brochure outlining Boston University on-campus housing options and costs. Residence rates are assessed based on the type of room or apartment to which a student is assigned. In dormitory-style residences, there are seven different room types–single, double, triple, and quad rooms that have either shared bathrooms on a floor or private bathrooms within a room or suite. In apartment-style residences, there are five different types of accommodations–single- or multiple-occupancy bedroom apartments, all with bathrooms and kitchens. Dining plan rates vary depending on the dining plan selected. Students assigned to dormitory-style residences are required to choose one of the six dining plans. Visit the BU Housing website for more information on on-campus housing options. Note: Exchange student may choose to live off-campus; if you choose to live off campus you are responsible for finding your own housing.",
  "cost_of_living": "According to the information available on the Boston University website, exchange students can refer to the Budgeting Tab on the following page for information on the estimated monthly living expenses: http://www.bu.edu/abroad/plan/financial-aid/. Exchange students can deduct the cost of tuition which they will not need to pay to BU."
}
