{
  "university_name": "Trinity College Dublin",
  "university_website": ["https://www.tcd.ie/study/study-abroad/inbound/apply/sa-exchange/index.php", "https://www.tcd.ie/calendar/academic-year-structure/"],
  "university_country": "Ireland",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["Faculty of Arts, Humanities & Social Sciences", "Faculty of Science, Technology, Engineering and Mathematics"],
  "module_restrictions": "Postgraduate modules are not opened to undergraduate exchange students. NUS students can apply to most academic fields at TCD. There are, however, certain restrictions set out in TCD’s study abroad module directory that are not open to exchange students or are only open to Semester 2 or full-year exchange students. NUS students are not permitted to take Dentistry, Medicine and Business modules.",
  "visa_info": "All students are advised to apply for the necessary visa immediately after they receive the official offer letter/email from their host university. The visa application process could take up to 2 months to process. Your exchange at the host university depends on clearance by the immigration of the host country. Please check if you need a visa here: https://www.irishimmigration.ie/wp-content/uploads/2021/07/Immigration-Service-Delivery-Visa-and-Non-Visa-Required-Countries.pdf All students who do NOT hold an EU passport must register with the Irish Naturalisation and Immigration Service (INIS) after arrival in Ireland. Further information on the requirements to register can be found on the INIS website: https://www.irishimmigration.ie/coming-to-study-in-ireland/before-and-after-you-arrive/what-do-i-need-to-do-after-arriving/. Trinity’s Immigration FAQs for Students: https://www.tcd.ie/students/supports-services/international-students.php",
  "accommodations_info": "Accommodation on-campus is extremely limited and not guaranteed. Incoming students are mainly accommodated in College residences at Trinity Hall, Binary Hub and Kavanagh Court. Non-EU students can apply as soon as they have confirmed acceptance of an offer of a place in Trinity College and have received their TCD ID number. Private Accommodation: If you do not secure university housing, or wish to find your own accommodation, TCD’s Accommodation Advisory Service helps students to find accommodation by providing them with advice and access to house-hunting resources. Students are advised to arrive in Dublin at least 2-3 weeks before the teaching begins in order to secure suitable and affordable accommodation.",
  "cost_of_living": "Estimated Monthly Living Expenses\nAccommodation: €1000 approx.\nFood: approx. €200 a month\nTransport: depending on location, approx. €120 a month\nInsurance: can range in price from €200 – €1,800 annually\nOthers (Entertainment, clothes, mobile phone, utilities, books etc.): €75-100 a month\nEstimated cost per month: about €1200-1500 a month including rent"
}