{
  "university_name": "University of Auckland",
  "university_website": ["https://www.auckland.ac.nz/dates", "http://www.auckland.ac.nz/studyabroad-exchange", "https://covid19.govt.nz/", "https://drive.google.com/file/d/1nCbxIo7ktmBbdE8XUTMGPODCpzlJS8wG/view", "https://www.auckland.ac.nz/en/study/international-students/study-options-for-international-students/study-abroad-and-exchange/study-abroad-programme-options/download-study-abroad-brochures.html"],
  "university_country": "New Zealand",
  "sem1_months": ["MAR", "APR", "MAY", "JUN"],
  "sem2_months": ["JUL", "AUG", "SEP", "OCT", "NOV"],
  "faculties_accepted": ["College of Humanities and Sciences (CHS)", "Faculty of Science (FoS)", "Faculty of Arts and Social Sciences (FASS)", "NUS Business School (BIZ)", "School of Computing (SoC)", "College of Design and Engineering (CDE or FoE)", "Yong Loo Lin School of Medicine (YLLSOM)", "School of Law (LAW)", "School of Nursing", "Yong Siew Toh Conservatory of Music (YSTCM)"],
  "module_restrictions": null,
  "visa_info": "Exchange students must apply to New Zealand Immigration for a student visa and obtain the visa before entering New Zealand. Please note that it is NOT possible for exchange students to travel to New Zealand on a visitor's visa and apply for a student permit upon arrival in New Zealand, even if you are a citizen of a country with which New Zealand has a visa waiver agreement. It is imperative that all exchange students get their student visa BEFORE travelling to New Zealand, as you may be refused a student permit if you apply from within New Zealand. Students are advised to apply for the necessary visa immediately after they received the official offer letter/email from their host university. This is to ensure that you can obtain your visa in time before the start of your exchange term. Your exchange at the host university depends on the clearance by the immigration of the host country. For more information on visa applications, please refer to https://www.immigration.govt.nz/new-zealand-visas/options/study",
  "accommodations_info": "Exchange students are required to purchase a compulsory medical and travel insurance when studying in New Zealand. The University of Auckland’s preferred insurance policy for International students is Studentsafe-University. The estimated cost is NZ$350 per semester. The Studentsafe insurance fee will be charged to students account automatically upon enrolment. It is recommended that you purchase a comprehensive travel insurance for the full duration of your stay abroad, including your personal travel within/outside Australia. Please review the insurance coverages to ensure that they meet your needs. Students can purchase additional health and/or travel insurance from their preferred agent.",
  "cost_of_living": "The University of Auckland does not provide a specific breakdown of the cost of living in the PDF. However, students should be prepared for expenses such as accommodation, food, transportation, study materials, and personal expenses. The cost of living in Auckland is generally higher compared to other cities in New Zealand. According to various sources, the estimated monthly living expenses for a student in Auckland range from NZD 1,200 to NZD 2,000. This includes accommodation, groceries, transportation, and entertainment. It is important to budget and plan accordingly to ensure a comfortable stay during the exchange program."
}
