{
  "university_name": "Waseda University",
  "university_website": ["https://www.waseda.jp/top/en", "https://www.waseda.jp/inst/cie/en/exchange/application", "http://www.waseda.jp/sils/en/student/oneyear/Important_Notes_for_SP3.pdf", "https://www.waseda.jp/inst/rlc/en/student_dormitory/exchange/", "http://www.waseda.jp/rlc/exchangedorm/index.html", "https://myportal.nus.edu.sg/studentportal/student-insurance/all/", "http://www.mofa.go.jp/j_info/visit/visa/index.html", "https://www.waseda.jp/inst/cie/en/exchange/practical"],
  "university_country": "Tokyo, Japan",
  "sem1_months": ["April", "May", "June", "July", "August"],
  "sem2_months": ["September", "October", "November", "December", "January", "February"],
  "faculties_accepted": ["School of Political Science", "School of Law", "School of Education", "School of Commerce", "School of Social Sciences", "Contemporary Japanese Studies Program", "School of International Liberal Studies (SILS)", "School of Culture, Media and Society", "School of Humanities and Social Sciences", "School of Fundamental Science and Engineering", "School of Creative Science and Engineering", "School of Advanced Science and Engineering", "School of Human Sciences", "School of Sport Sciences"],
  "module_restrictions": "Graduate courses are not offered to undergraduate students. Exchange students must select the courses offered by school which you have selected at Waseda. Students enrolled in the Japanese-based programme are not allowed to take courses offered in English. The School of Fundamental Science and Engineering, School of Creative Science and Engineering and School of Advanced Science and Engineering only accept students in their third year or above. Undergraduate Studies Program: September admission is not available for School of Law, School of Education, School of Human Science and School of Sport Sciences. One semester of study is not applicable for School of Education, School of Human Science and School of Sport Science.",
  "visa_info": "Upon acceptance, Waseda will apply for a Certificate of Eligibility on your behalf with the Japanese Ministry of Justice, and send it to you when issued. The certificate is required for you to apply for a study visa. Exchange students must obtain a “College Student” visa for the duration of their study in Japan. Please visit the Japan Embassy website for the required supporting documents for your visa application. All students are advised to apply for the necessary visa immediately after they received the official offer letter/email from their host university. This is to ensure that you can obtain your visa in time before the start of your exchange term. Your exchange at the host university depends on the clearance by the immigration of the host country.",
  "accommodations_info": "Exchange students will be housed at the Waseda University International Student House, Waseda Hoshien, or Nishi-Waseda International Student House, which are within walking distance to Waseda, Toyama and Nishi-Waseda campus. The Residence Life Center assigns rooms based on a first come, first served basis and the number of rooms is limited. Due to limited space in dormitories for exchange students, some students make their own arrangements to reside in off-campus accommodations such as shared houses or apartments. Housing application information will be sent together with acceptance notification. Waseda will provide students with a list of recommended off-campus accommodations in the event that the university dormitories are full.",
  "cost_of_living": "Estimated Monthly Living Expenses: Accommodation - JP¥50,000 to JP¥75,000, Food - JP¥30,000 to JP¥60,000, Transport - JP¥8,000 to JP¥20,000, Insurance - JP¥2,000 to JP¥3,000, Others (Entertainment, clothes) - JP¥25,000. Monthly Estimate - JP¥115,000 to JP¥183,000."
}