{
  "university_name": "Fudan University",
  "university_website": [
    "http://www.fao.fudan.edu.cn/1616/list.htm",
    "https://www.fudan.edu.cn/en/SchoolswDepartments/list.psp",
    "https://ogp.fudan.edu.cn/16092/list.htm",
    "https://iso.fudan.edu.cn/isoenglish/16212/list.htm",
    "http://www.fao.fudan.edu.cn/32/d7/c16089a13015/page.htm",
    "https://ogp.fudan.edu.cn/16089/list.htm",
    "https://www.visaforchina.cn/SGP2_EN/index.shtml",
    "https://ogp.fudan.edu.cn/16088/list.htm",
    "https://myportal.nus.edu.sg/studentportal/student-insurance/all/",
    "http://en.lxbx.net/#slide2"
  ],
  "university_country": "China",
  "sem1_months": [
    "AUG",
    "SEP",
    "OCT",
    "NOV",
    "DEC"
  ],
  "sem2_months": [
    "FEB",
    "MAR",
    "APR",
    "MAY",
    "JUN"
  ],
  "faculties_accepted": [
    "CHS",
    "FoS",
    "FASS",
    "BIZ",
    "SoC",
    "DENT",
    "CDE",
    "YLLSOM",
    "LAW",
    "Yong Siew Toh Conservatory of Music (YSTCM)"
  ],
  "module_restrictions": "MBA courses and some special programs in faculties (eg Language\nSchool) are not available to Exchange and Study Abroad students.",
  "visa_info": "Exchange students in China are required to apply for student visa (X2 visa\nfor those intending to study in China for a period of no more than 180 days\nand X1 visa for those intending to study in China for a period of more than\n180 days).\nYou will receive the admission letter and visa application form (JW202)\nonce you are accepted by the host university for the student exchange\nprogramme.  Exchange students are required to apply for the student visa\nin person at the China Visa Application Service Centre in Singapore with\nthe relevant documents before the start of the academic semester.\nChina Visa Application Service Centre in Singapore:\nhttps://www.visaforchina.cn/SGP2_EN/index.shtml\nhttps://www.visaforchina.cn/#/guideNav/Guidance?visacenterCode=SGP\n2&request_locale=en_US&site_alias=SGP2_EN\nVisa information at Fudan University:\nhttps://ogp.fudan.edu.cn/16088/list.htm",
  "accommodations_info": "Exchange students are housed at the International Students Dormitory\nlocated northwest of the Fudan campus. There are single and double\nrooms available. There is a 24-hour reception desk available at the lobby,\nwith a mini-supermarket and meeting place. The gymnasium and\nstudents’ dining halls are nearby. Students who are staying for an entire\nacademic year are eligible for accommodation on campus during semester\nbreaks. Accommodation fees will be pro-rated.\nOn-campus accommodation is very limited and on first come first served\npolicy, students are reminded to check the booking period at the\nfollowing website and apply for accommodation early.\nhttps://ogp.fudan.edu.cn/16089/list.htm\nhttps://iso.fudan.edu.cn/isoenglish/16212/list.htm\n\nIf on-campus accommodation is not available, students are advised to try\nthe following resources as soon as possible:\n1. Tonghe International Student village\nAdd: Wuong Road Lane 28 (off campus, across the road to Foreign\n  Students Dormitory)\n Telephone number: +86-21-65105187\n Price Reference: A room in a 3-room apartment is 70/80/90 RMB/day.\n2. Hanting Hotels and Inns\nAdd: Songhuajiang Road 2628 (off campus, close to undergraduate\n living area)\n Telephone number: +86-21-61434888\n Price Reference: 140-180 RMB/day for king-size or double-bed room\nFor more information, please refer to\nhttp://www.fao.fudan.edu.cn/32/d7/c16089a13015/page.htm",
  "cost_of_living": "The cost of living in China varies depending on the city and lifestyle.\n\nGenerally, accommodation costs range from RMB 2,000 to RMB 5,000 per month for a single person.\n\nTransportation expenses can be around RMB 200 to RMB 500 per month, depending on the mode of transportation used.\n\nMeals can cost around RMB 1,500 to RMB 3,000 per month, depending on individual eating habits.\n\nOther expenses, such as entertainment, books, and personal items, can add up to RMB 500 to RMB 1,000 per month.\n\nOverall, the estimated total cost of living in China for a semester is approximately RMB 10,000 to RMB 20,000."
}