{
  "university_name": "Warsaw University of Technology (WUT)",
  "university_website": ["https://www.cwm.pw.edu.pl/index.php/en/Education-programmes/Bilateral-exchange/Incoming-students"],
  "university_country": "Poland",
  "sem1_months": ["OCT", "NOV", "DEC", "JAN"],
  "sem2_months": ["FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["FoE", "FoS", "SoC"],
  "module_restrictions": "Students are reminded to review the online course list carefully as it contains important information which is often ignored. Please read so that you will save time, effort and have less stress in your application process.",
  "visa_info": "All students are advised to apply for the necessary visa immediately after they received the official offer letter/email from their host university. Some visa application process could take up to 2 months to process. Your exchange at the host university depends on the clearance by the immigration of the host country. A citizen of a non-EU country has to obtain the visa from the consulate of Poland in his/her country of residence to support their stay of more than 90 days in Poland. For details please contact the Polish Consulate in your country. All students should legalize their stay exceeding 3 months by obtaining temporary residence permit after their arrival to Poland with the help from WUT.",
  "accommodations_info": "WUT dormitories are located outside the campus but not very far. WUT offers around 5200 places in 12 dormitories in Warsaw. Most rooms are usually double or triple sharing. University accommodation is not guaranteed. Accommodation process is run by a special section of Students Union - Accommodation Commission (Komisja Kwaterunkowa). Whole process is run via online system called SEKS2. Candidates will be able to apply for dormitory. They will have to submit their applications through Online Accommodation System. Detailed information will be sent directly to candidates. The dormitory application procedure is fully arranged and run by Student’s Union Accommodation Committee. Please take note that there are separate intakes for different exchange students.",
  "cost_of_living": "The estimated monthly living expenses in Poland are as follows:\n\n- Accommodation: PLN480 - PLN700\n- Food: PLN125 - PLN200\n- Transport: PLN50 - PLN75\n- Telecommunication: PLN60\n- Insurance (purchased in WUT): PLN50\n- Others (Entertainment, clothes): PLN50 - PLN100\n\nMonthly Estimate: PLN815 - PLN1,185"
}
