{
  "university_name": "Case Western Reserve University",
  "university_website": [
    "https://case.edu/international/international-student-services/exchange-programs",
    "https://studyabroad.case.edu/index.cfm?FuseAction=Programs.ViewProgram&Program_ID=10839"
  ],
  "university_country": "USA",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["Arts & Sciences", "Engineering", "Management"],
  "module_restrictions": "Exchange students are eligible to take any UG course at Case, as long as they meet the pre-requisites and there is vacancy in the course. In general, 400 level courses and above are PG courses, and are not available to students participating in this exchange programme.",
  "visa_info": "All students are advised to apply for the necessary visa immediately after they receive the official offer letter/email from their host university. Some visa application processes can take up to 2 months to process. Your exchange at the host university depends on the clearance by the immigration of the host country. The I-20 form, which will be issued by the Immigration and Human Resource Services (IRHS), is to be presented to the U.S. consulate or U.S. embassy to apply for an F-1 student visa. Make an appointment as soon as possible because lengthy delays may occur as background checks are performed prior to your appointment. Consular standards for visa eligibility may be considerably more rigorous than the standards you must meet to qualify for a DS-2019. The Consular Officer will require you to provide the same (and possibly additional) financial documentation you provided Case Western Reserve University. You will be required to show this documentation again upon arrival in the United States at your port of entry. United States government regulations require you to attend the school which issues the visa certificate you use to enter the U.S.",
  "accommodations_info": "There are a variety of housing options available for students studying at Case Western Reserve University. You may choose to live in university-owned housing or in off-campus, privately-owned housing. Whichever you choose, you must secure housing before you arrive in the United States. Please note on-campus accommodation is not guaranteed. University-Owned Housing: Options for upper-class students include North and South Campus Residence Halls, the Village at 115th, North Property Management Apartments, the Apartments at 1576, and the Triangle Apartments. Details of these options are available at housing.case.edu. Students who wish to live in university housing can request placement through the New Student Checklist - when it becomes available. Please contact both the University Housing Office (housing@case.edu or +001 216-368-3780) and the Orientation Office (firstyearexperience@case.edu) for more information. Students who live on campus can have meals in campus dining halls. If desired, you will sign up for a meal plan as part of your housing application. The cost of the meal plan will vary depending on the plan you choose. Off-Campus Housing: Students also have the option to live off-campus in the University Circle area. Numerous off-campus options are available for you to explore. The Uptown Apartments, located minutes away from campus with convenient access to Uptown’s many shops and restaurants, are particularly popular. If you are interested in living off-campus you can search ALOHA, the Off-Campus Housing Listing Service available online: students.case.edu/services/aloha/. Students living off-campus move into their housing at the discretion of their housing agency. On-Campus Dining: Students who live on- or off-campus can have meals in campus dining halls. If desired, you will sign up for a meal plan as part of your housing application. The cost of the meal plan will vary depending on the plan you choose. Meal plan options are available at https://case.edu/dining/meal-plans/meal-plan-options. Living in University Circle: University Circle is a dynamic modern arts and cultural district. Home to a variety of museums, excellent restaurants, coffee shops, and festivals, there is always something to do in University Circle. Wade Oval hosts year-round outdoor programming including live concerts, movie nights, art walks, parades, and ice skating. *Note with all housing options - linens and towels are typically not included and should be planned for accordingly.",
  "cost_of_living": "The estimated monthly living expenses vary depending on individual lifestyles and spending habits, but on average, students can expect to spend around $1,500 to $2,000 per month. This includes accommodation, meals, transportation, books and supplies, personal expenses, and health insurance. Please note that tuition fees are waived for exchange students.",
  "visa_info": "All students are advised to apply for the necessary visa immediately after they receive the official offer letter/email from their host university. Some visa application processes can take up to 2 months to process. Your exchange at the host university depends on the clearance by the immigration of the host country."
}