{
  "university_name": "Tsinghua University",
  "university_website": ["https://www.tsinghua.edu.cn/en/Campus/Student_Life/Academic_Calendar.htm", "https://www.tsinghua.edu.cn/en/Schools___Departments.htm", "http://intl-nondegree.tsinghua.edu.cn/f/yzlxs/yz_lxs_kstzb/view?id=264623", "https://www.tsinghua.edu.cn/en/Campus/Student_Life/Housing___Dining.htm", "https://www.visaforchina.cn/SGP2_EN/index.shtml", "https://is.tsinghua.edu.cn/vp/FIS.htm", "http://is.tsinghua.edu.cn/publish/isscen/index.html"],
  "university_country": "China",
  "sem1_months": ["SEP", "OCT", "NOV", "DEC", "JAN"],
  "sem2_months": ["FEB", "MAR", "APR", "MAY", "JUN"],
  "faculties_accepted": ["FASS", "FoS", "CDE", "SoC", "LAW"],
  "module_restrictions": "MBA and the Master of Law programmes are not open to exchange students. Cross faculty modules are allowed but should not exceed 8 credits. Courses conducted by Academy of Arts and Design and Physical training courses are not open to exchange students; LLM, MBA, MPA, courses taught in English offered by the School of Architecture are not open to exchange students.",
  "visa_info": "Exchange students in China are required to apply for student visa (X2 visa for those intending to study in China for a period of no more than 180 days and X1 visa for those intending to study in China for a period of more than 180 days). You will receive the admission letter and visa application form (JW202) once you are accepted by the host university for the student exchange programme. Exchange students are required to apply for the student visa in person at the China Visa Application Service Centre in Singapore with the relevant documents before the start of the academic semester. China Visa Application Service Centre in Singapore: https://www.visaforchina.cn/SGP2_EN/index.shtml",
  "accommodations_info": "Tsinghua will prioritise university-level exchange students with on-campus accommodation at Zijing Foreign Student Apartments. The apartment charges different prices for different room types. Typical double room charges RMB 40 per day and single room charges RMB 80 per day. Students may visit https://www.tsinghua.edu.cn/en/Campus/Student_Life/Housing___Dining.htm for more details. As there are limited on-campus accommodation, exchange students who have received Tsinghua University’s Admission Notice are required to reserve the rooms in advance by the specific deadline and to follow the application instructions found in the Foreign Students Dormitory Application System along with the admission package.",
  "cost_of_living": "The cost of living in Tsinghua University varies depending on individual spending and lifestyle choices. Generally, students should budget for accommodation, meals, transportation, books, and personal expenses. Accommodation in on-campus student apartments can cost RMB 40 per day for a double room and RMB 80 per day for a single room. Additional costs may include meals, which can range from RMB 20-30 per day, transportation expenses, textbooks, and personal expenses. It is recommended for students to budget approximately RMB 5,000 to RMB 15,000 per semester for living expenses during the exchange programme."
}