{
  "university_name": "University of Notre Dame",
  "university_website": [
    "http://www.nd.edu/",
    "http://registrar.nd.edu/calendar/"
  ],
  "university_country": "USA",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": [
    "FASS",
    "FoS",
    "CDE",
    "SoC",
    "LAW"
  ],
  "module_restrictions": "College of Arts & Letters - Some core courses in Economics may not be available for the incoming/visiting students, due to limited spots.\nCollege of Engineering - Please note that some core courses in the following three engineering disciplines might not be available to incoming/visiting students: Aerospace, Mechanical, and Computer Science Engineering.\nSchool of Architecture - Incoming/visiting students interested in Architecture will only have 2nd- and 4th-year courses available and will need to meet eligibility requirements for these courses. Please note that applying to the School of Architecture may require additional application materials such as a portfolio and syllabi from completed courses at your home university. For more information on course restrictions, please refer here: https://international.nd.edu/students-scholars/global-engagement-programs/semester-academic-year-programs/academics/course-registration/",
  "visa_info": "All exchange students are required to obtain a J-1 student visa. Upon acceptance into the program, UND’s office will issue a DS-2019 form, with which participants can apply for the J-1 visa at the nearest U.S. Embassy or Consulate. For more information for international students please visit the website of UND’s International Student and Scholar Affairs. https://issa.nd.edu/",
  "accommodations_info": "Due to a shortage of on-campus accommodation at UND, exchange and visiting international students are not guaranteed on-campus housing. Thus, some students will need to secure their own off-campus housing. Students who wish to live on campus will need to fill out a housing application and will be entered in a lottery. Students living off campus are able to sign up for a meal plan. If available, there are 31 undergraduate residence halls that represent 31 distinctive communities, which together with Notre Dame’s two graduate housing facilities, continue the rich tradition of residential life at the University. From the earliest days, residential life has been a defining characteristic of the Notre Dame education. Social events, inter-hall sports, community service projects, spiritual retreats, and time-honored traditions unique to each residence hall define Notre Dame's culture and have created what truly is the Notre Dame family. If you are required to seek off-campus housing on your own, you will receive notification of this as early as possible. Further assistance will be provided by NDI. Please note that filling out the housing application for the on-campus dormitories does not guarantee a spot on campus. On the rare occasion that on-campus housing is not available, you may be asked to find housing off-campus even if you have already filled out the housing application for on-campus dorms. You will still be able to participate in dorm activities and can request to be “adopted” by a dorm to be involved in their events. Students will be provided with a meal plan offered through campus dining. The meal plan is included in the program cost. While the plan allows students to eat food in the two dining halls at Notre Dame, they can use Domer Dollars to buy a meal from other food places on campus. Domer Dollars provide campus ID card-holders the ability to make purchases at many on-campus businesses and select off-campus merchants without the need to carry cash or credit cards. Campus vending and laundry also accept Domer Dollars and unlike a credit card, there are no deposit fees, no mounting debts with Domer Dollars, no interest charged, and no monthly bill – just a record of the debits made from your already deposited funds.",
  "cost_of_living": "The estimated monthly living expenses at UND can vary depending on personal spending habits. According to UND, as of July 2021, the estimated costs are as follows:\n- Rent: $600-$1,200\n- Utilities: $100-$150\n- Groceries: $200-$300\n- Transportation: $30-$80\n- Phone and Internet: $50-$100\n- Health Insurance: $200\nPlease note that these are just estimates and actual costs may differ. It is recommended to budget accordingly and plan for possible fluctuations in expenses."
}