{
  "university_name": "Bilkent University",
  "university_website": ["http://www.bilkent.edu.tr/index.html", "http://www.bilkent.edu.tr/bilkent/academic/exchange/calendar.html", "http://www.bilkent.edu.tr/bilkent-tr/admin-unit/yurt/exchange_index.html", "http://www.bilkent.edu.tr/bilkent/academic/exchange/visa_permit.html", "http://www.bilkent.edu.tr/bilkent/academic/exchange/cost.html", "http://www.nus.edu.sg/iro/fa/sch/out/ytp.html", "http://www.bilkent.edu.tr/bilkent/academic/exchange/BilkentUniv_FactSheet_%20pdf", "http://w3.bilkent.edu.tr/bilkent/transportation/"],
  "university_country": "Turkey",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["FASS", "FoS", "CDE", "SoC", "LAW"],
  "module_restrictions": "There is no restriction in courses or programmes for exchange students. However, students must keep in mind that the language of instruction in some departments is mainly in Turkish. Students need the approval of the instructor if they wish to take courses that have prerequisite requirements and courses from graduate programs. Course information: https://stars.bilkent.edu.tr/homepage/academic_units.php. Previous semester course offerings are for reference only and are subject to changes. Courses will only be finalized by the offering departments upon arrival at Bilkent.",
  "visa_info": "Students coming from the countries, which are exempted from the visa requirement to Turkey, do not have to apply to the Turkish Embassy/Consulates for any type of visa and may directly come to Turkey with their passports. Residence permit application will be made during the Orientation Program. Students who need 'student visa' to enter Turkey are supposed to apply for the student visa at the Turkish Consulate as soon as they receive their acceptance letter. Students are advised to have adequate time for the visa to be processed prior to the departure.",
  "accommodations_info": "Bilkent University offers FREE on-campus housing for all exchange students. The offer is valid for double rooms and allocations are on a first-come-first-served basis. In the acceptance packages, students will receive their Bilkent ID number and a STARS Password which they have to use for their online application to the dormitories. Accommodation application periods: (Sem 1): 15 May to 14 July 2017, (Sem 2): 15 December 2017 to 14 January 2018.",
  "cost_of_living": "More information about estimated semester living expenses can be found here: http://www.bilkent.edu.tr/bilkent/academic/exchange/cost.html. Please note that direct application by students will not be accepted by the International Relations Office (IRO). For SEP, eligible students who have received the NASA Exchange Award will be invited to apply for YTP-Market Immersion funding. More information can be found here: http://www.nus.edu.sg/iro/fa/sch/out/ytp.html."
}
