{
  "university_name": "Karlsruhe Institute of Technology (KIT)",
  "university_website": ["http://www.intl.kit.edu/istudies/3242.php", "http://www.intl.kit.edu/istudies/3157.php"],
  "university_country": "Germany",
  "sem1_months": ["OCT", "NOV", "DEC", "JAN", "FEB"],
  "sem2_months": ["APR", "MAY", "JUN", "JUL"],
  "faculties_accepted": ["College of Humanities and Sciences (CHS)", "Faculty of Science (FoS)", "Faculty of Arts and Social Sciences (FASS)", "School of Computing (SoC)"],
  "module_restrictions": "The Carl-Benz-School / International Department offers an international Bachelor study program in English at the Department of Mechanical Engineering with restricted admission, which only offers limited access to exchange students.",
  "visa_info": "EU citizens and citizens from Australia, Canada, Honduras, Iceland, Israel, Japan, Korea, Liechtenstein, Monaco, New Zealand, Norway, San Marino, Switzerland, and the United States do not need a visa to enter Germany. Students from all other countries must apply for a visa for study purposes via the German diplomatic representation in their home country.",
  "accommodations_info": "Most students in Karlsruhe live in dormitories or share a flat. KIT cannot guarantee the availability of accommodation but will assist all exchange students settling down in Karlsruhe. Students will be informed about housing possibilities within 8 weeks of the application deadline. KIT reserves rooms for students from partner universities in their students’ residences if possible. These furnished single rooms cost about €355 and have a set lease period from March to August. No other moving in/out date is possible. A contract ending in August or September requires payment until August or September with no refund if the student leaves earlier.",
  "cost_of_living": "The estimated monthly living expenses in Karlsruhe are as follows:\n\n- Accommodation: €355\n- Insurance: €80\n- Transport: €34\n- Food: €168\n- Others (Books, entertainment etc.): €265\n\nThe monthly estimate for living expenses is €902. Students from partner universities also pay a social contribution of about €77.70 per semester."
}
