{
  "university_name": "Georgia Institute of Technology",
  "university_website": ["http://www.gatech.edu", "https://oie.gatech.edu/accordion-exchange-student-application"],
  "university_country": "USA",
  "sem1_months": ["AUG", "SEP", "OCT", "NOV", "DEC"],
  "sem2_months": ["JAN", "FEB", "MAR", "APR", "MAY"],
  "faculties_accepted": ["FASS", "FoS", "FoE", "SoC"],
  "module_restrictions": "If you are admitted to GT as an undergraduate student, you must have specific permission to take graduate level courses.",
  "visa_info": "Once accepted into the Exchange Program, Georgia Tech’s Office of International Education (OIE) will email the student with a link to the DS-2019 Information e-form requesting the following documents:\n• Copy of Passport (biographical page)\n• Financial Documentation\nGeorgia Tech will then issue and mail the DS-2019 form according to the preference indicated in the nomination form. Student must then:\n• Pay I-901 SEVIS fee at fmjfee.com\n• Apply for a J-1 Visa\n• Please visit travel.state.gov and j1visa.state.gov for visa application information.\nPlease note: Visas can take several weeks to process. Students should apply for the J-1 Visa as soon as possible.\nWhen traveling to the United States, student’s passport must be valid at least 6 months into the future.",
  "accommodations_info": "Georgia Tech and the surrounding Atlanta neighbourhoods offer a wide variety of housing options to suit most preferences. Many Exchange students want a more standard US college experience and therefore choose to live on-campus. Others prefer a bit more freedom and ease of living among Atlantans rather than students 24/7. Whichever you think is best for you, please keep the following information in mind as you prepare to study at Georgia Tech.\nOn-Campus: Exchange students must be formally admitted to Georgia Tech before you can apply to live on campus. This means completing all of the requirements (all 3 steps) of the application process. If you think you want to live on campus, please complete your application as early as possible. On-campus housing does fill up, and we want every student who wants to live on campus to have that opportunity. Georgia Tech cannot guarantee on-campus housing to all applicants.\nOff-Campus: Please click here for a few tips on finding off-campus housing.",
  "cost_of_living": "Please refer to this webpage - https://oie.gatech.edu/accordion-exchange-student-application - and scroll down to the Costs associated with GT Exchange tab for more information on the cost of an exchange at GA Tech."
}
